{
  "Happy": [
    {
      "title": "The Grand Budapest Hotel",
      "overview": "The Grand Budapest Hotel tells of a legendary concierge at a famous European hotel between the wars and his friendship with a young employee who becomes his trusted protégé. The story involves the theft and recovery of a priceless Renaissance painting, the battle for an enormous family fortune and the slow and then sudden upheavals that transformed Europe during the first half of the 20th century.",
      "rating": 8.042,
      "release_date": "2014-02-26",
      "poster_url": "https://image.tmdb.org/t/p/w500/eWdyYQreja6JGCzqHWXpWHDrrPo.jpg"
    },
    {
      "title": "Zootopia",
      "overview": "Determined to prove herself, Officer Judy Hopps, the first bunny on Zootopia's police force, jumps at the chance to crack her first case - even if it means partnering with scam-artist fox Nick Wilde to solve the mystery.",
      "rating": 7.747,
      "release_date": "2016-02-11",
      "poster_url": "https://image.tmdb.org/t/p/w500/hlK0e0wAQ3VLuJcsfIYPvb4JVud.jpg"
    },
    {
      "title": "School of Rock",
      "overview": "Fired from his band and hard up for cash, guitarist and vocalist Dewey Finn finagles his way into a job as a fifth-grade substitute teacher at a private school, where he secretly begins teaching his students the finer points of rock 'n' roll. The school's hard-nosed principal is rightly suspicious of Finn's activities. But Finn's roommate remains in the dark about what he's doing.",
      "rating": 7.083,
      "release_date": "2003-10-03",
      "poster_url": "https://image.tmdb.org/t/p/w500/zXLXaepIBvFVLU25DH3wv4IPSbe.jpg"
    },
    {
      "title": "Singin' in the Rain",
      "overview": "In 1927 Hollywood, a silent film production company and cast make a difficult transition to sound.",
      "rating": 8.145,
      "release_date": "1952-04-10",
      "poster_url": "https://image.tmdb.org/t/p/w500/w03EiJVHP8Un77boQeE7hg9DVdU.jpg"
    },
    {
      "title": "Paddington 2",
      "overview": "Paddington, now happily settled with the Browns, picks up a series of odd jobs to buy the perfect present for his Aunt Lucy, but it is stolen.",
      "rating": 7.465,
      "release_date": "2017-11-09",
      "poster_url": "https://image.tmdb.org/t/p/w500/1OJ9vkD5xPt3skC6KguyXAgagRZ.jpg"
    },
    {
      "title": "The Intouchables",
      "overview": "A true story of two men who should never have met – a quadriplegic aristocrat who was injured in a paragliding accident and a young man from the projects.",
      "rating": 0,
      "release_date": "",
      "poster_url": "https://image.tmdb.org/t/p/w500null"
    },
    {
      "title": "Ferris Bueller's Day Off",
      "overview": "After high school slacker Ferris Bueller successfully fakes an illness in order to skip school for the day, he goes on a series of adventures throughout Chicago with his girlfriend Sloane and best friend Cameron, all the while trying to outwit his wily school principal and fed-up sister.",
      "rating": 7.576,
      "release_date": "1986-06-11",
      "poster_url": "https://image.tmdb.org/t/p/w500/9LTQNCvoLsKXP0LtaKAaYVtRaQL.jpg"
    },
    {
      "title": "The Lego Movie",
      "overview": "An ordinary Lego mini-figure, mistakenly thought to be the extraordinary MasterBuilder, is recruited to join a quest to stop an evil Lego tyrant from conquering the universe.",
      "rating": 7.415,
      "release_date": "2014-02-06",
      "poster_url": "https://image.tmdb.org/t/p/w500/lbctonEnewCYZ4FYoTZhs8cidAl.jpg"
    },
    {
      "title": "Finding Nemo",
      "overview": "Nemo, an adventurous young clownfish, is unexpectedly taken from his Great Barrier Reef home to a dentist's office aquarium. It's up to his worrisome father Marlin and a friendly but forgetful fish Dory to bring Nemo home -- meeting vegetarian sharks, surfer dude turtles, hypnotic jellyfish, hungry seagulls, and more along the way.",
      "rating": 7.816,
      "release_date": "2003-05-30",
      "poster_url": "https://image.tmdb.org/t/p/w500/eHuGQ10FUzK1mdOY69wF5pGgEf5.jpg"
    },
    {
      "title": "Up",
      "overview": "Carl Fredricksen spent his entire life dreaming of exploring the globe and experiencing life to its fullest. But at age 78, life seems to have passed him by, until a twist of fate (and a persistent 8-year old Wilderness Explorer named Russell) gives him a new lease on life.",
      "rating": 7.957,
      "release_date": "2009-05-28",
      "poster_url": "https://image.tmdb.org/t/p/w500/mFvoEwSfLqbcWwFsDjQebn9bzFe.jpg"
    },
    {
      "title": "The Princess Bride",
      "overview": "In this enchantingly cracked fairy tale, the beautiful Princess Buttercup and the dashing Westley must overcome staggering odds to find happiness amid six-fingered swordsmen, murderous princes, Sicilians and rodents of unusual size. But even death can't stop these true lovebirds from triumphing.",
      "rating": 7.7,
      "release_date": "1987-09-25",
      "poster_url": "https://image.tmdb.org/t/p/w500/kTXxdNv44najTayFcrT487xWuDv.jpg"
    },
    {
      "title": "Amélie",
      "overview": "At a tiny Parisian café, the adorable yet painfully shy Amélie accidentally discovers a gift for helping others. Soon Amelie is spending her days as a matchmaker, guardian angel, and all-around do-gooder. But when she bumps into a handsome stranger, will she find the courage to become the star of her very own love story?",
      "rating": 7.913,
      "release_date": "2001-04-25",
      "poster_url": "https://image.tmdb.org/t/p/w500/oTKduWL2tpIKEmkAqF4mFEAWAsv.jpg"
    },
    {
      "title": "The Secret Life of Walter Mitty",
      "overview": "A timid magazine photo manager who lives life vicariously through daydreams embarks on a true-life adventure when a negative goes missing.",
      "rating": 7.197,
      "release_date": "2013-12-18",
      "poster_url": "https://image.tmdb.org/t/p/w500/tY6ypjKOOtujhxiSwTmvA4OZ5IE.jpg"
    },
    {
      "title": "Chef",
      "overview": "When Chef Carl Casper suddenly quits his job at a prominent Los Angeles restaurant after refusing to compromise his creative integrity for its controlling owner, he is left to figure out what's next. Finding himself in Miami, he teams up with his ex-wife, his friend and his son to launch a food truck. Taking to the road, Chef Carl goes back to his roots to reignite his passion for the kitchen -- and zest for life and love.",
      "rating": 7.112,
      "release_date": "2014-05-08",
      "poster_url": "https://image.tmdb.org/t/p/w500/hyp8EXDmO4dSC8V6Q5jU7gD1kcg.jpg"
    },
    {
      "title": "Little Miss Sunshine",
      "overview": "A family loaded with quirky, colorful characters piles into an old van and road trips to California for little Olive to compete in a beauty pageant.",
      "rating": 7.693,
      "release_date": "2006-07-26",
      "poster_url": "https://image.tmdb.org/t/p/w500/wKn7AJw730emlmzLSmJtzquwaeW.jpg"
    },
    {
      "title": "The Pursuit of Happyness",
      "overview": "A struggling salesman takes custody of his son as he's poised to begin a life-changing professional career.",
      "rating": 7.9,
      "release_date": "2006-12-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/lBYOKAMcxIvuk9s9hMuecB9dPBV.jpg"
    },
    {
      "title": "Forrest Gump",
      "overview": "A man with a low IQ has accomplished great things in his life and been present during significant historic events—in each case, far exceeding what anyone imagined he could do. But despite all he has achieved, his one true love eludes him.",
      "rating": 8.468,
      "release_date": "1994-06-23",
      "poster_url": "https://image.tmdb.org/t/p/w500/arw2vcBveWOVZr6pxd9XTd1TdQa.jpg"
    },
    {
      "title": "Billy Elliot",
      "overview": "County Durham, England, 1984. The miners' strike has started and the police have started coming up from Bethnal Green, starting a class war with the lower classes suffering. Caught in the middle of the conflict is 11-year old Billy Elliot, who, after leaving his boxing club for the day, stumbles upon a ballet class and finds out that he's naturally talented. He practices with his teacher Mrs. Wilkinson for an upcoming audition in Newcastle-upon Tyne for the royal Ballet school in London.",
      "rating": 7.595,
      "release_date": "2000-09-28",
      "poster_url": "https://image.tmdb.org/t/p/w500/nOr5diUZxphmAD3li9aiILyI28F.jpg"
    },
    {
      "title": "The Sound of Music",
      "overview": "In the years before the Second World War, a tomboyish postulant at an Austrian abbey is hired as a governess in the home of a widowed naval captain with seven children, and brings a new love of life and music into the home.",
      "rating": 7.7,
      "release_date": "1965-03-02",
      "poster_url": "https://image.tmdb.org/t/p/w500/nv8bcyqXJh2tijWLa3MoUktlVZZ.jpg"
    },
    {
      "title": "The Greatest Showman",
      "overview": "The story of American showman P.T. Barnum, founder of the circus that became the famous traveling Ringling Bros. and Barnum & Bailey Circus.",
      "rating": 7.877,
      "release_date": "2017-12-20",
      "poster_url": "https://image.tmdb.org/t/p/w500/b9CeobiihCx1uG1tpw8hXmpi7nm.jpg"
    },
    {
      "title": "La La Land",
      "overview": "Mia, an aspiring actress, serves lattes to movie stars in between auditions and Sebastian, a jazz musician, scrapes by playing cocktail party gigs in dingy bars, but as success mounts they are faced with decisions that begin to fray the fragile fabric of their love affair, and the dreams they worked so hard to maintain in each other threaten to rip them apart.",
      "rating": 7.9,
      "release_date": "2016-12-01",
      "poster_url": "https://image.tmdb.org/t/p/w500/uDO8zWDhfWwoFdKS4fzkUJt0Rf0.jpg"
    },
    {
      "title": "Inside Out",
      "overview": "When 11-year-old Riley moves to a new city, her Emotions team up to help her through the transition. Joy, Fear, Anger, Disgust and Sadness work together, but when Joy and Sadness get lost, they must journey through unfamiliar places to get back home.",
      "rating": 7.911,
      "release_date": "2015-06-17",
      "poster_url": "https://image.tmdb.org/t/p/w500/2H1TmgdfNtsKlU9jKdeNyYL5y8T.jpg"
    },
    {
      "title": "Ratatouille",
      "overview": "Remy, a resident of Paris, appreciates good food and has quite a sophisticated palate. He would love to become a chef so he can create and enjoy culinary masterpieces to his heart's delight. The only problem is, Remy is a rat. When he winds up in the sewer beneath one of Paris' finest restaurants, the rodent gourmet finds himself ideally placed to realize his dream.",
      "rating": 7.827,
      "release_date": "2007-06-28",
      "poster_url": "https://image.tmdb.org/t/p/w500/t3vaWRPSf6WjDSamIkKDs1iQWna.jpg"
    },
    {
      "title": "Sing",
      "overview": "A koala named Buster recruits his best friend to help him drum up business for his theater by hosting a singing competition.",
      "rating": 7.114,
      "release_date": "2016-11-23",
      "poster_url": "https://image.tmdb.org/t/p/w500/zZTlF2eVVUkbdmccd3bNUU9T9sD.jpg"
    },
    {
      "title": "Mamma Mia!",
      "overview": "A spirited young bride-to-be living with her single mother on a small Greek island secretly invites three of her mother's ex-boyfriends in hope of finding her biological father to walk her down the aisle.",
      "rating": 6.978,
      "release_date": "2008-07-03",
      "poster_url": "https://image.tmdb.org/t/p/w500/zdUA4FNHbXPadzVOJiU0Rgn6cHR.jpg"
    },
    {
      "title": "Bridget Jones's Diary",
      "overview": "Bridget Jones is an average woman struggling against her age, her weight, her job, her lack of a man, and her various imperfections. As a New Year's resolution, Bridget decides to take control of her life, starting by keeping a diary in which she will always tell the complete truth. The fireworks begin when her charming though disreputable boss takes an interest in the quirky Miss Jones. Thrown into the mix are Bridget's band of slightly eccentric friends and a rather disagreeable acquaintance into whom Bridget cannot seem to stop running or help finding quietly attractive.",
      "rating": 6.747,
      "release_date": "2001-04-13",
      "poster_url": "https://image.tmdb.org/t/p/w500/dkauRl9TosBFikftrC3OVcKWDoz.jpg"
    },
    {
      "title": "Love Actually",
      "overview": "Eight very different couples deal with their love lives in various loosely interrelated tales all set during a frantic month before Christmas in London.",
      "rating": 7.1,
      "release_date": "2003-09-07",
      "poster_url": "https://image.tmdb.org/t/p/w500/7QPeVsr9rcFU9Gl90yg0gTOTpVv.jpg"
    },
    {
      "title": "Crazy Rich Asians",
      "overview": "An American-born Chinese economics professor accompanies her boyfriend to Singapore for his best friend's wedding, only to get thrust into the lives of Asia's rich and famous.",
      "rating": 7.068,
      "release_date": "2018-08-15",
      "poster_url": "https://image.tmdb.org/t/p/w500/1XxL4LJ5WHdrcYcihEZUCgNCpAW.jpg"
    },
    {
      "title": "The Intern",
      "overview": "70-year-old widower Ben Whittaker has discovered that retirement isn't all it's cracked up to be. Seizing an opportunity to get back in the game, he becomes a senior intern at an online fashion site, founded and run by Jules Ostin.",
      "rating": 7.221,
      "release_date": "2015-09-23",
      "poster_url": "https://image.tmdb.org/t/p/w500/9UoAC9tu8kIyRy8AcJnGhnH0gOH.jpg"
    },
    {
      "title": "Julie & Julia",
      "overview": "Julia Child and Julie Powell – both of whom wrote memoirs – find their lives intertwined. Though separated by time and space, both women are at loose ends... until they discover that with the right combination of passion, fearlessness and butter, anything is possible.",
      "rating": 6.705,
      "release_date": "2009-08-06",
      "poster_url": "https://image.tmdb.org/t/p/w500/r1bFBBj3VMek0oEtgm9N51OqVjF.jpg"
    }
  ],
  "Sad": [
    {
      "title": "Schindler's List",
      "overview": "The true story of how businessman Oskar Schindler saved over a thousand Jewish lives from the Nazis while they worked as slaves in his factory during World War II.",
      "rating": 8.565,
      "release_date": "1993-12-15",
      "poster_url": "https://image.tmdb.org/t/p/w500/sF1U4EUQS8YHUYjNl3pMGNIQyr0.jpg"
    },
    {
      "title": "Grave of the Fireflies",
      "overview": "Hisako loses her home in Tokyo to Allied bombing. With her husband fighting somewhere in Asia, she and her two children evacuate to a suburb of Kobe, where they share a house with Hisako's cousin, Kyoko. Kobe is bombed and Kyoko is killed. Hisako is forced to take care of Kyoko's two children in addition to her own, but there is not enough food for everyone.",
      "rating": 7.857,
      "release_date": "2005-11-01",
      "poster_url": "https://image.tmdb.org/t/p/w500/im6u58cPa9HlH5DqSnZGy0O37l5.jpg"
    },
    {
      "title": "Manchester by the Sea",
      "overview": "After his older brother passes away, Lee Chandler is forced to return home to care for his 16-year-old nephew. There he is compelled to deal with a tragic past that separated him from his family and the community where he was born and raised.",
      "rating": 7.547,
      "release_date": "2016-11-17",
      "poster_url": "https://image.tmdb.org/t/p/w500/o9VXYOuaJxCEKOxbA86xqtwmqYn.jpg"
    },
    {
      "title": "Requiem for a Dream",
      "overview": "The drug-induced utopias of four Coney Island residents are shattered when their addictions run deep.",
      "rating": 8.015,
      "release_date": "2000-10-06",
      "poster_url": "https://image.tmdb.org/t/p/w500/nOd6vjEmzCT0k4VYqsA2hwyi87C.jpg"
    },
    {
      "title": "The Green Mile",
      "overview": "A supernatural tale set on death row in a Southern prison, where gentle giant John Coffey possesses the mysterious power to heal people's ailments. When the cell block's head guard, Paul Edgecomb, recognizes Coffey's miraculous gift, he tries desperately to help stave off the condemned man's execution.",
      "rating": 8.505,
      "release_date": "1999-12-10",
      "poster_url": "https://image.tmdb.org/t/p/w500/8VG8fDNiy50H4FedGwdSVUPoaJe.jpg"
    },
    {
      "title": "Atonement",
      "overview": "As a 13-year-old, fledgling writer Briony Tallis irrevocably changes the course of several lives when she accuses her older sister's lover of a crime he did not commit.",
      "rating": 7.643,
      "release_date": "2007-02-27",
      "poster_url": "https://image.tmdb.org/t/p/w500/hMRIyBjPzxaSXWM06se3OcNjIQa.jpg"
    },
    {
      "title": "The Pianist",
      "overview": "The true story of pianist Władysław Szpilman's experiences in Warsaw during the Nazi occupation. When the Jews of the city find themselves forced into a ghetto, Szpilman finds work playing in a café; and when his family is deported in 1942, he stays behind, works for a while as a laborer, and eventually goes into hiding in the ruins of the war-torn city.",
      "rating": 8.379,
      "release_date": "2002-09-17",
      "poster_url": "https://image.tmdb.org/t/p/w500/2hFvxCCWrTmCYwfy7yum0GKRi3Y.jpg"
    },
    {
      "title": "Brokeback Mountain",
      "overview": "In 1960s Wyoming, two men develop a strong emotional and sexual relationship that endures as a lifelong connection complicating their lives as they get married and start families of their own.",
      "rating": 7.783,
      "release_date": "2005-10-22",
      "poster_url": "https://image.tmdb.org/t/p/w500/aByfQOQBNa4CMFwIgq3QrqY2ZHh.jpg"
    },
    {
      "title": "Blue Valentine",
      "overview": "Dean and Cindy live a quiet life in a modest neighborhood. They appear to have the world at their feet at the outset of the relationship. However, his lack of ambition and her retreat into self-absorption cause potentially irreversible cracks in their marriage.",
      "rating": 6.947,
      "release_date": "2010-12-26",
      "poster_url": "https://image.tmdb.org/t/p/w500/dc8BdKnDY5Iy28KzUGtHIXuqqFK.jpg"
    },
    {
      "title": "The Boy in the Striped Pyjamas",
      "overview": "When his family moves from their home in Berlin to a strange new house in Poland, young Bruno befriends Shmuel, a boy who lives on the other side of the fence where everyone seems to be wearing striped pajamas. Unaware of Shmuel's fate as a Jewish prisoner or the role his own Nazi father plays in his imprisonment, Bruno embarks on a dangerous journey inside the camp's walls.",
      "rating": 7.827,
      "release_date": "2008-05-07",
      "poster_url": "https://image.tmdb.org/t/p/w500/sLwYSEVVV3r047cjrpRAbGgNsfL.jpg"
    },
    {
      "title": "My Oni Girl",
      "overview": "A shy teenage boy's inability to say no is tested when a headstrong girl drags him on a mystical journey amid summer snow to find her missing mom.",
      "rating": 7.3,
      "release_date": "2024-05-24",
      "poster_url": "https://image.tmdb.org/t/p/w500/k69kkwsipkPn7Nzq488kHGQTPo.jpg"
    },
    {
      "title": "Million Dollar Baby",
      "overview": "Despondent over a painful estrangement from his daughter, trainer Frankie Dunn isn't prepared for boxer Maggie Fitzgerald to enter his life. But Maggie's determined to go pro and to convince Dunn and his cohort to help her.",
      "rating": 7.955,
      "release_date": "2004-12-05",
      "poster_url": "https://image.tmdb.org/t/p/w500/jcfEqKdWF1zeyvECPqp3mkWLct2.jpg"
    },
    {
      "title": "The Fault in Our Stars",
      "overview": "Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a patient named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel's story is about to be completely rewritten.",
      "rating": 7.599,
      "release_date": "2014-05-16",
      "poster_url": "https://image.tmdb.org/t/p/w500/ep7dF4QR4Mm39LI958V0XbwE0hK.jpg"
    },
    {
      "title": "Hachi: A Dog's Tale",
      "overview": "A drama based on the true story of a college professor's bond with the abandoned dog he takes into his home.",
      "rating": 8.01,
      "release_date": "2009-06-08",
      "poster_url": "https://image.tmdb.org/t/p/w500/lsy3aEsEfYIHdLRk4dontZ4s85h.jpg"
    },
    {
      "title": "The Road",
      "overview": "A father and his son walk alone through burned America. Nothing moves in the ravaged landscape save the ash on the wind and water. It is cold enough to crack stones and, when the snow falls, it is gray. Their destination is the warmer south, although they don't know what, if anything, awaits them there.",
      "rating": 7.013,
      "release_date": "2009-11-25",
      "poster_url": "https://image.tmdb.org/t/p/w500/qLaXnLzqleBWQtjvZ6JGVSaKoC3.jpg"
    },
    {
      "title": "Dancer in the Dark",
      "overview": "Selma, a Czech immigrant on the verge of blindness, struggles to make ends meet for herself and her son, who has inherited the same genetic disorder and will suffer the same fate without an expensive operation. When life gets too difficult, Selma learns to cope through her love of musicals, escaping life's troubles – even if just for a moment – by dreaming up little numbers to the rhythmic beats of her surroundings.",
      "rating": 7.875,
      "release_date": "2000-09-01",
      "poster_url": "https://image.tmdb.org/t/p/w500/9rsivF4sWfmBzrNr4LPu6TNJhXX.jpg"
    },
    {
      "title": "The Lovely Bones",
      "overview": "After being brutally murdered, 14-year-old Susie Salmon watches from heaven over her grief-stricken family -- and her killer. As she observes their daily lives, she must balance her thirst for revenge with her desire for her family to heal.",
      "rating": 7.067,
      "release_date": "2009-12-26",
      "poster_url": "https://image.tmdb.org/t/p/w500/sn0iDphRxQ7I6aLd9igIgACITak.jpg"
    },
    {
      "title": "Revolutionary Road",
      "overview": "A young couple living in a Connecticut suburb during the mid-1950s struggle to come to terms with their personal problems while trying to raise their two children. Based on a novel by Richard Yates.",
      "rating": 6.985,
      "release_date": "2008-12-19",
      "poster_url": "https://image.tmdb.org/t/p/w500/lLkVzVPKeBov5lh5yaeRun1xYzS.jpg"
    },
    {
      "title": "The Notebook",
      "overview": "An epic love story centered around an older man who reads aloud to a woman with Alzheimer's. From a faded notebook, the old man's words bring to life the story about a couple who is separated by World War II, and is then passionately reunited, seven years later, after they have taken different paths.",
      "rating": 7.889,
      "release_date": "2004-05-25",
      "poster_url": "https://image.tmdb.org/t/p/w500/rNzQyW4f8B8cQeg7Dgj3n6eT5k9.jpg"
    },
    {
      "title": "Dear Zachary: A Letter to a Son About His Father",
      "overview": "In 2001, Andrew Bagby, a medical resident, is murdered not long after breaking up with his girlfriend. Soon after, when she announces she's pregnant, one of Andrew's many close friends, Kurt Kuenne, begins this film, a gift to the child.",
      "rating": 8.1,
      "release_date": "2008-10-31",
      "poster_url": "https://image.tmdb.org/t/p/w500/bVJCQfIfNC01CYOVkvBOtrY1cxy.jpg"
    },
    {
      "title": "Leaving Las Vegas",
      "overview": "Ben Sanderson, an alcoholic Hollywood screenwriter who lost everything because of his drinking, arrives in Las Vegas to drink himself to death. There, he meets and forms an uneasy friendship and non-interference pact with prostitute Sera.",
      "rating": 7.252,
      "release_date": "1995-10-27",
      "poster_url": "https://image.tmdb.org/t/p/w500/wTrFpGe3U65kXTldIUxuM2hmOAK.jpg"
    },
    {
      "title": "Precious",
      "overview": "Set in Harlem in 1987, Claireece \"Precious\" Jones is a 16-year-old African American girl born into a life no one would want. She's pregnant for the second time by her absent father; at home, she must wait hand and foot on her mother, an angry woman who abuses her emotionally and physically. School is chaotic and Precious has reached the ninth grade with good marks and a secret; She can't read.",
      "rating": 7.316,
      "release_date": "2009-11-06",
      "poster_url": "https://image.tmdb.org/t/p/w500/d4ltLIDbvZskSwbzXqi0Hfv5ma4.jpg"
    },
    {
      "title": "The Elephant Man",
      "overview": "A Victorian surgeon rescues a heavily disfigured man being mistreated by his \"owner\" as a side-show freak. Behind his monstrous façade, there is revealed a person of great intelligence and sensitivity. Based on the true story of Joseph Merrick (called John Merrick in the film), a severely deformed man in 19th century London.",
      "rating": 8.049,
      "release_date": "1980-10-09",
      "poster_url": "https://image.tmdb.org/t/p/w500/u0wpPYjuSt8DIe1Y3Vapnh8jcKE.jpg"
    },
    {
      "title": "Philadelphia",
      "overview": "Two competing lawyers join forces to sue a prestigious law firm for AIDS discrimination. As their unlikely friendship develops their courage overcomes the prejudice and corruption of their powerful adversaries.",
      "rating": 7.713,
      "release_date": "1993-12-22",
      "poster_url": "https://image.tmdb.org/t/p/w500/tFe5Yoo5zT495okA49bq1vPPkiV.jpg"
    },
    {
      "title": "The Hours",
      "overview": "The story of three women searching for more potent, meaningful lives. Each is alive at a different time and place, all are linked by their yearnings and their fears. Their stories intertwine, and finally come together in a surprising, transcendent moment of shared recognition.",
      "rating": 7.276,
      "release_date": "2002-12-27",
      "poster_url": "https://image.tmdb.org/t/p/w500/4myDtowDJQPQnkEDB1IWGtJR1Fo.jpg"
    },
    {
      "title": "The Color Purple",
      "overview": "A decades-spanning tale of love and resilience and of one woman's journey to independence. Celie faces many hardships in her life, but ultimately finds extraordinary strength and hope in the unbreakable bonds of sisterhood.",
      "rating": 7.092,
      "release_date": "2023-12-25",
      "poster_url": "https://image.tmdb.org/t/p/w500/h5bqIxM8GO4TewJ0u6Rzkg58ssJ.jpg"
    },
    {
      "title": "Mystic River",
      "overview": "The lives of three men who were childhood friends are shattered when one of them suffers a family tragedy.",
      "rating": 7.7,
      "release_date": "2003-10-07",
      "poster_url": "https://image.tmdb.org/t/p/w500/hCHVDbo6XJGj3r2i4hVjKhE0GKF.jpg"
    },
    {
      "title": "Dead Poets Society",
      "overview": "At an elite, old-fashioned boarding school in New England, a passionate English teacher inspires his students to rebel against convention and seize the potential of every day, courting the disdain of the stern headmaster.",
      "rating": 8.302,
      "release_date": "1989-06-02",
      "poster_url": "https://image.tmdb.org/t/p/w500/erzbMlcNHOdx24AXOcn2ZKA7R1q.jpg"
    },
    {
      "title": "Life Is Beautiful",
      "overview": "A touching story of an Italian book seller of Jewish ancestry who lives in his own little fairy tale. His creative and happy life would come to an abrupt halt when his entire family is deported to a concentration camp during World War II. While locked up he tries to convince his son that the whole thing is just a game.",
      "rating": 8.448,
      "release_date": "1997-12-20",
      "poster_url": "https://image.tmdb.org/t/p/w500/74hLDKjD5aGYOotO6esUVaeISa2.jpg"
    },
    {
      "title": "The Kite Runner",
      "overview": "After spending years in California, Amir returns to his homeland in Afghanistan to help his old friend Hassan, whose son is in trouble.",
      "rating": 7.325,
      "release_date": "2007-12-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/dom2esWWW8C9jS2v7dOhW48LwHh.jpg"
    }
  ],
  "Hopeful": [
    {
      "title": "The Shawshank Redemption",
      "overview": "Imprisoned in the 1940s for the double murder of his wife and her lover, upstanding banker Andy Dufresne begins a new life at the Shawshank prison, where he puts his accounting skills to work for an amoral warden. During his long stretch in prison, Dufresne comes to be admired by the other inmates -- including an older prisoner named Red -- for his integrity and unquenchable sense of hope.",
      "rating": 8.71,
      "release_date": "1994-09-23",
      "poster_url": "https://image.tmdb.org/t/p/w500/9cqNxx0GxF0bflZmeSMuL5tnGzr.jpg"
    },
    {
      "title": "Life Is Beautiful",
      "overview": "A touching story of an Italian book seller of Jewish ancestry who lives in his own little fairy tale. His creative and happy life would come to an abrupt halt when his entire family is deported to a concentration camp during World War II. While locked up he tries to convince his son that the whole thing is just a game.",
      "rating": 8.448,
      "release_date": "1997-12-20",
      "poster_url": "https://image.tmdb.org/t/p/w500/74hLDKjD5aGYOotO6esUVaeISa2.jpg"
    },
    {
      "title": "Amélie",
      "overview": "At a tiny Parisian café, the adorable yet painfully shy Amélie accidentally discovers a gift for helping others. Soon Amelie is spending her days as a matchmaker, guardian angel, and all-around do-gooder. But when she bumps into a handsome stranger, will she find the courage to become the star of her very own love story?",
      "rating": 7.913,
      "release_date": "2001-04-25",
      "poster_url": "https://image.tmdb.org/t/p/w500/oTKduWL2tpIKEmkAqF4mFEAWAsv.jpg"
    },
    {
      "title": "The Secret Life of Walter Mitty",
      "overview": "A timid magazine photo manager who lives life vicariously through daydreams embarks on a true-life adventure when a negative goes missing.",
      "rating": 7.197,
      "release_date": "2013-12-18",
      "poster_url": "https://image.tmdb.org/t/p/w500/tY6ypjKOOtujhxiSwTmvA4OZ5IE.jpg"
    },
    {
      "title": "Little Miss Sunshine",
      "overview": "A family loaded with quirky, colorful characters piles into an old van and road trips to California for little Olive to compete in a beauty pageant.",
      "rating": 7.693,
      "release_date": "2006-07-26",
      "poster_url": "https://image.tmdb.org/t/p/w500/wKn7AJw730emlmzLSmJtzquwaeW.jpg"
    },
    {
      "title": "Pay It Forward",
      "overview": "Like some other kids, 12-year-old Trevor McKinney believed in the goodness of human nature. Like many other kids, he was determined to change the world for the better. Unlike most other kids, he succeeded.",
      "rating": 7.352,
      "release_date": "2000-10-20",
      "poster_url": "https://image.tmdb.org/t/p/w500/62OIokwaxFwBFWM147ijLJsaVJD.jpg"
    },
    {
      "title": "About Time",
      "overview": "The night after another unsatisfactory New Year's party, Tim's father tells his son that the men in his family have always had the ability to travel through time. They can't change history, but they can change what happens and has happened in their own lives. Thus begins the start of a lesson in learning to appreciate life itself as it is, as it comes, and most importantly, the people living alongside us.",
      "rating": 7.916,
      "release_date": "2013-09-04",
      "poster_url": "https://image.tmdb.org/t/p/w500/iR1bVfURbN7r1C46WHFbwCkVve.jpg"
    },
    {
      "title": "The Intouchables",
      "overview": "A true story of two men who should never have met – a quadriplegic aristocrat who was injured in a paragliding accident and a young man from the projects.",
      "rating": 0,
      "release_date": "",
      "poster_url": "https://image.tmdb.org/t/p/w500null"
    },
    {
      "title": "The Perks of Being a Wallflower",
      "overview": "Pittsburgh, Pennsylvania, 1991. High school freshman Charlie is a wallflower, always watching life from the sidelines, until two senior students, Sam and her stepbrother Patrick, become his mentors, helping him discover the joys of friendship, music and love.",
      "rating": 7.796,
      "release_date": "2012-09-20",
      "poster_url": "https://image.tmdb.org/t/p/w500/aKCvdFFF5n80P2VdS7d8YBwbCjh.jpg"
    },
    {
      "title": "Julie & Julia",
      "overview": "Julia Child and Julie Powell – both of whom wrote memoirs – find their lives intertwined. Though separated by time and space, both women are at loose ends... until they discover that with the right combination of passion, fearlessness and butter, anything is possible.",
      "rating": 6.705,
      "release_date": "2009-08-06",
      "poster_url": "https://image.tmdb.org/t/p/w500/r1bFBBj3VMek0oEtgm9N51OqVjF.jpg"
    },
    {
      "title": "The Pursuit of Happyness",
      "overview": "A struggling salesman takes custody of his son as he's poised to begin a life-changing professional career.",
      "rating": 7.9,
      "release_date": "2006-12-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/lBYOKAMcxIvuk9s9hMuecB9dPBV.jpg"
    },
    {
      "title": "A Beautiful Day in the Neighborhood",
      "overview": "An award-winning cynical journalist, Lloyd Vogel, begrudgingly accepts an assignment to write an Esquire profile piece on the beloved television icon Fred Rogers. After his encounter with Rogers, Vogel's perspective on life is transformed.",
      "rating": 6.965,
      "release_date": "2019-09-07",
      "poster_url": "https://image.tmdb.org/t/p/w500/p9vCAVhDK375XyobVcKqzqzsUHE.jpg"
    },
    {
      "title": "Paddington 2",
      "overview": "Paddington, now happily settled with the Browns, picks up a series of odd jobs to buy the perfect present for his Aunt Lucy, but it is stolen.",
      "rating": 7.465,
      "release_date": "2017-11-09",
      "poster_url": "https://image.tmdb.org/t/p/w500/1OJ9vkD5xPt3skC6KguyXAgagRZ.jpg"
    },
    {
      "title": "The Hundred-Foot Journey",
      "overview": "A story centered around an Indian family who moves to France and opens a restaurant across the street from a Michelin-starred French restaurant.",
      "rating": 7.292,
      "release_date": "2014-08-06",
      "poster_url": "https://image.tmdb.org/t/p/w500/1vFhSr7INoulu18smHqicft05i8.jpg"
    },
    {
      "title": "Soul",
      "overview": "Joe Gardner is a middle school teacher with a love for jazz music. After a successful audition at the Half Note Club, he suddenly gets into an accident that separates his soul from his body and is transported to the You Seminar, a center in which souls develop and gain passions before being transported to a newborn child. Joe must enlist help from the other souls-in-training, like 22, a soul who has spent eons in the You Seminar, in order to get back to Earth.",
      "rating": 8.11,
      "release_date": "2020-12-25",
      "poster_url": "https://image.tmdb.org/t/p/w500/pEz5aROvfy5FBW1OTlrDO3VryWO.jpg"
    },
    {
      "title": "The Boy Who Harnessed the Wind",
      "overview": "Against all the odds, a thirteen year old boy in Malawi invents an unconventional way to save his family and village from famine.",
      "rating": 7.902,
      "release_date": "2019-02-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/yOr7RxHw15MMXNxGMXSmngDqHyI.jpg"
    },
    {
      "title": "The Peanut Butter Falcon",
      "overview": "A down-on-his-luck crab fisherman embarks on a journey to get a young man with Down syndrome to a professional wrestling school in rural North Carolina and away from the retirement home where he’s lived for the past two and a half years.",
      "rating": 7.416,
      "release_date": "2019-08-09",
      "poster_url": "https://image.tmdb.org/t/p/w500/qyQcRGvdW3VtxHR4fSDgPOePEip.jpg"
    },
    {
      "title": "Wonder",
      "overview": "The story of August Pullman – a boy with facial differences – who enters fifth grade, attending a mainstream elementary school for the first time.",
      "rating": 8.122,
      "release_date": "2017-11-13",
      "poster_url": "https://image.tmdb.org/t/p/w500/sONh3LYGFcVDTy8pm1tbSOB13Li.jpg"
    },
    {
      "title": "Finding Forrester",
      "overview": "Gus Van Sant tells the story of a young African American man named Jamal who confronts his talents while living on the streets of the Bronx. He accidentally runs into an old writer named Forrester who discovers his passion for writing. With help from his new mentor Jamal receives a scholarship to a private school.",
      "rating": 7.113,
      "release_date": "2000-12-21",
      "poster_url": "https://image.tmdb.org/t/p/w500/chd9bCGNYtzDoJqGw5wUHlhrkOb.jpg"
    },
    {
      "title": "Billy Elliot",
      "overview": "County Durham, England, 1984. The miners' strike has started and the police have started coming up from Bethnal Green, starting a class war with the lower classes suffering. Caught in the middle of the conflict is 11-year old Billy Elliot, who, after leaving his boxing club for the day, stumbles upon a ballet class and finds out that he's naturally talented. He practices with his teacher Mrs. Wilkinson for an upcoming audition in Newcastle-upon Tyne for the royal Ballet school in London.",
      "rating": 7.595,
      "release_date": "2000-09-28",
      "poster_url": "https://image.tmdb.org/t/p/w500/nOr5diUZxphmAD3li9aiILyI28F.jpg"
    },
    {
      "title": "Freedom Writers",
      "overview": "A young teacher inspires her class of at-risk students to learn tolerance, apply themselves, and pursue education beyond high school.",
      "rating": 7.921,
      "release_date": "2007-01-05",
      "poster_url": "https://image.tmdb.org/t/p/w500/81AdeUQT99N0xPg3j6RVh0YGOTk.jpg"
    },
    {
      "title": "Hugo",
      "overview": "Orphaned and alone except for an uncle, Hugo Cabret lives in the walls of a train station in 1930s Paris. Hugo's job is to oil and maintain the station's clocks, but to him, his more important task is to protect a broken automaton and notebook left to him by his late father. Accompanied by the goddaughter of an embittered toy merchant, Hugo embarks on a quest to solve the mystery of the automaton and find a place he can call home.",
      "rating": 7.171,
      "release_date": "2011-11-22",
      "poster_url": "https://image.tmdb.org/t/p/w500/1dxRq3o3l3bVWNRvvSb7rRf68qp.jpg"
    },
    {
      "title": "Up",
      "overview": "Carl Fredricksen spent his entire life dreaming of exploring the globe and experiencing life to its fullest. But at age 78, life seems to have passed him by, until a twist of fate (and a persistent 8-year old Wilderness Explorer named Russell) gives him a new lease on life.",
      "rating": 7.957,
      "release_date": "2009-05-28",
      "poster_url": "https://image.tmdb.org/t/p/w500/mFvoEwSfLqbcWwFsDjQebn9bzFe.jpg"
    },
    {
      "title": "A Man Called Otto",
      "overview": "When a lively young family moves in next door, grumpy widower Otto Anderson meets his match in a quick-witted, pregnant woman named Marisol, leading to an unlikely friendship that turns his world upside down.",
      "rating": 7.754,
      "release_date": "2022-12-28",
      "poster_url": "https://image.tmdb.org/t/p/w500/130H1gap9lFfiTF9iDrqNIkFvC9.jpg"
    },
    {
      "title": "Luca",
      "overview": "Luca and his best friend Alberto experience an unforgettable summer on the Italian Riviera. But all the fun is threatened by a deeply-held secret: they are sea monsters from another world just below the water’s surface.",
      "rating": 7.806,
      "release_date": "2021-06-17",
      "poster_url": "https://image.tmdb.org/t/p/w500/9x4i9uKGXt8IiiIF5Ey0DIoY738.jpg"
    },
    {
      "title": "Hearts Beat Loud",
      "overview": "In the hip Brooklyn neighborhood of Red Hook, single dad and record store owner Frank is preparing to send his hard-working daughter Sam off to college while being forced to close his vintage shop. Hoping to stay connected through their shared musical passions, Frank urges Sam to turn their weekly jam sessions into a father-daughter live act. After their first song becomes an internet breakout, the two embark on a journey of love, growing up and musical discovery.",
      "rating": 7,
      "release_date": "2018-06-08",
      "poster_url": "https://image.tmdb.org/t/p/w500/h1wKptD8iXJbtAUSz9OlXS3q4Co.jpg"
    },
    {
      "title": "CODA",
      "overview": "As a CODA (Child of Deaf Adults), Ruby is the only hearing person in her deaf family. When the family's fishing business is threatened, Ruby finds herself torn between pursuing her love of music and her fear of abandoning her parents.",
      "rating": 7.92,
      "release_date": "2021-08-13",
      "poster_url": "https://image.tmdb.org/t/p/w500/BzVjmm8l23rPsijLiNLUzuQtyd.jpg"
    },
    {
      "title": "Akeelah and the Bee",
      "overview": "11-year-old Akeelah Anderson has a way with words. After winning her schoolwide spelling bee, she decides to enter the competition, despite her classmates' derision and the antipathy of her mother Tanya. Thanks to the efforts of her teacher Dr. Larabee, she reaches the finala. As she gets to know her fellow competitors, Akeelah realizes that coming first isn't everything in life.",
      "rating": 7.09,
      "release_date": "2006-04-28",
      "poster_url": "https://image.tmdb.org/t/p/w500/tLejxaLJu8Qh5F2VKacWniMSZ3v.jpg"
    },
    {
      "title": "The Book Thief",
      "overview": "While subjected to the horrors of WWII Germany, young Liesel finds solace by stealing books and sharing them with others. Under the stairs in her home, a Jewish refugee is being sheltered by her adoptive parents.",
      "rating": 7.492,
      "release_date": "2013-11-08",
      "poster_url": "https://image.tmdb.org/t/p/w500/wj4U5sMLcJMa3WR9CpRR9e2sdgZ.jpg"
    },
    {
      "title": "Big Fish",
      "overview": "Throughout his life Edward Bloom has always been a man of big appetites, enormous passions and tall tales. In his later years, he remains a huge mystery to his son, William. Now, to get to know the real man, Will begins piecing together a true picture of his father from flashbacks of his amazing adventures.",
      "rating": 7.759,
      "release_date": "2003-12-25",
      "poster_url": "https://image.tmdb.org/t/p/w500/tjK063yCgaBAluVU72rZ6PKPH2l.jpg"
    }
  ],
  "Angry": [
    {
      "title": "Joker",
      "overview": "During the 1980s, a failed stand-up comedian is driven insane and turns to a life of crime and chaos in Gotham City while becoming an infamous psychopathic crime figure.",
      "rating": 8.138,
      "release_date": "2019-10-01",
      "poster_url": "https://image.tmdb.org/t/p/w500/udDclJoHjfjb8Ekgsd4FDteOkCU.jpg"
    },
    {
      "title": "Fight Club",
      "overview": "A ticking-time-bomb insomniac and a slippery soap salesman channel primal male aggression into a shocking new form of therapy. Their concept catches on, with underground \"fight clubs\" forming in every town, until an eccentric gets in the way and ignites an out-of-control spiral toward oblivion.",
      "rating": 8.438,
      "release_date": "1999-10-15",
      "poster_url": "https://image.tmdb.org/t/p/w500/pB8BM7pdSp6B6Ih7QZ4DrQ3PmJK.jpg"
    },
    {
      "title": "Gladiator",
      "overview": "Tommy Riley has moved with his dad to Chicago from a 'nice place'. He keeps to himself, goes to school. However, after a street fight he is noticed and quickly falls into the world of illegal underground boxing - where punches can kill.",
      "rating": 7.6,
      "release_date": "1992-03-06",
      "poster_url": "https://image.tmdb.org/t/p/w500/w0YjBWVfu689txEXZG3xa4Aev3i.jpg"
    },
    {
      "title": "Oldboy",
      "overview": "A man has only three and a half days and limited resources to discover why he was imprisoned in a nondescript room for 20 years without any explanation.",
      "rating": 5.9,
      "release_date": "2013-11-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/iX93YdBrZA1EpGbphmjf4ARj1Za.jpg"
    },
    {
      "title": "John Wick",
      "overview": "Ex-hitman John Wick comes out of retirement to track down the gangsters that took everything from him.",
      "rating": 7.445,
      "release_date": "2014-10-22",
      "poster_url": "https://image.tmdb.org/t/p/w500/fZPSd91yGE9fCcCe6OoQr6E3Bev.jpg"
    },
    {
      "title": "Taxi Driver",
      "overview": "A mentally unstable Vietnam War veteran works as a night-time taxi driver in New York City where the perceived decadence and sleaze feed his urge for violent action.",
      "rating": 8.134,
      "release_date": "1976-02-09",
      "poster_url": "https://image.tmdb.org/t/p/w500/ekstpH614fwDX8DUln1a2Opz0N8.jpg"
    },
    {
      "title": "Kill Bill: Vol. 1",
      "overview": "An assassin is shot by her ruthless employer, Bill, and other members of their assassination circle – but she lives to plot her vengeance.",
      "rating": 7.97,
      "release_date": "2003-10-10",
      "poster_url": "https://image.tmdb.org/t/p/w500/v7TaX8kXMXs5yFFGR41guUDNcnB.jpg"
    },
    {
      "title": "V for Vendetta",
      "overview": "In a world in which Great Britain has become a fascist state, a masked vigilante known only as “V” conducts guerrilla warfare against the oppressive British government. When V rescues a young woman from the secret police, he finds in her an ally with whom he can continue his fight to free the people of Britain.",
      "rating": 7.898,
      "release_date": "2006-02-23",
      "poster_url": "https://image.tmdb.org/t/p/w500/1avD1JeaRiJX5M4ahPdZPypGoGN.jpg"
    },
    {
      "title": "The Revenant",
      "overview": "In the 1820s, a frontiersman, Hugh Glass, sets out on a path of vengeance against those who left him for dead after a bear mauling.",
      "rating": 7.534,
      "release_date": "2015-12-25",
      "poster_url": "https://image.tmdb.org/t/p/w500/ji3ecJphATlVgWNY0B0RVXZizdf.jpg"
    },
    {
      "title": "Django Unchained",
      "overview": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner.",
      "rating": 8.183,
      "release_date": "2012-12-25",
      "poster_url": "https://image.tmdb.org/t/p/w500/7oWY8VDWW7thTzWh3OKYRkWUlD5.jpg"
    },
    {
      "title": "Prisoners",
      "overview": "Keller Dover is facing every parent’s worst nightmare. His six-year-old daughter, Anna, is missing, together with her young friend, Joy, and as minutes turn to hours, panic sets in. The only lead is a dilapidated RV that had earlier been parked on their street.",
      "rating": 8.099,
      "release_date": "2013-09-19",
      "poster_url": "https://image.tmdb.org/t/p/w500/uhviyknTT5cEQXbn6vWIqfM4vGm.jpg"
    },
    {
      "title": "The Batman",
      "overview": "In his second year of fighting crime, Batman uncovers corruption in Gotham City that connects to his own family while facing a serial killer known as the Riddler.",
      "rating": 7.655,
      "release_date": "2022-03-01",
      "poster_url": "https://image.tmdb.org/t/p/w500/74xTEgt7R36Fpooo50r9T25onhq.jpg"
    },
    {
      "title": "Uncut Gems",
      "overview": "A charismatic New York City jeweler always on the lookout for the next big score makes a series of high-stakes bets that could lead to the windfall of a lifetime. Howard must perform a precarious high-wire act, balancing business, family, and encroaching adversaries on all sides in his relentless pursuit of the ultimate win.",
      "rating": 7.2,
      "release_date": "2019-08-30",
      "poster_url": "https://image.tmdb.org/t/p/w500/6XN1vxHc7kUSqNWtaQKN45J5x2v.jpg"
    },
    {
      "title": "The Girl with the Dragon Tattoo",
      "overview": "Disgraced journalist Mikael Blomkvist investigates the disappearance of a weary patriarch's niece from 40 years ago. He is aided by the pierced, tattooed, punk computer hacker named Lisbeth Salander. As they work together in the investigation, Blomkvist and Salander uncover immense corruption beyond anything they have ever imagined.",
      "rating": 7.375,
      "release_date": "2011-12-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/8bokS83zGdhaXgN9tjidUKmAftW.jpg"
    },
    {
      "title": "Gran Torino",
      "overview": "Disgruntled Korean War veteran Walt Kowalski sets out to reform his neighbor, Thao Lor, a Hmong teenager who tried to steal Kowalski's prized possession: a 1972 Gran Torino.",
      "rating": 7.989,
      "release_date": "2008-12-12",
      "poster_url": "https://image.tmdb.org/t/p/w500/zUybYvxWdAJy5hhYovsXtHSWI1l.jpg"
    },
    {
      "title": "Falling Down",
      "overview": "An ordinary man frustrated with the various flaws he sees in society begins to psychotically and violently lash out against them.",
      "rating": 7.391,
      "release_date": "1993-02-26",
      "poster_url": "https://image.tmdb.org/t/p/w500/7ujqyF96Zg3rfrsh9M0cEF0Yzqj.jpg"
    },
    {
      "title": "Law Abiding Citizen",
      "overview": "A frustrated man decides to take justice into his own hands after a plea bargain sets one of his family's killers free. He targets not only the killer but also the district attorney and others involved in the deal.",
      "rating": 7.384,
      "release_date": "2009-10-15",
      "poster_url": "https://image.tmdb.org/t/p/w500/wqFq0wzRbuqnQfJJ14aXp36D3BD.jpg"
    },
    {
      "title": "The Equalizer",
      "overview": "McCall believes he has put his mysterious past behind him and dedicated himself to beginning a new, quiet life. But when he meets Teri, a young girl under the control of ultra-violent Russian gangsters, he can’t stand idly by – he has to help her. Armed with hidden skills that allow him to serve vengeance against anyone who would brutalize the helpless, McCall comes out of his self-imposed retirement and finds his desire for justice reawakened. If someone has a problem, if the odds are stacked against them, if they have nowhere else to turn, McCall will help. He is The Equalizer.",
      "rating": 7.28,
      "release_date": "2014-09-24",
      "poster_url": "https://image.tmdb.org/t/p/w500/9u4yW7yPA0BQ2pv9XwiNzItwvp8.jpg"
    },
    {
      "title": "Sicario",
      "overview": "An idealistic FBI agent is enlisted by a government task force to aid in the escalating war against drugs at the border area between the U.S. and Mexico.",
      "rating": 7.412,
      "release_date": "2015-09-17",
      "poster_url": "https://image.tmdb.org/t/p/w500/lz8vNyXeidqqOdJW9ZjnDAMb5Vr.jpg"
    },
    {
      "title": "Training Day",
      "overview": "On his first day on the job as a narcotics officer, a rookie cop works with a rogue detective who isn't what he appears.",
      "rating": 7.505,
      "release_date": "2001-10-05",
      "poster_url": "https://image.tmdb.org/t/p/w500/bUeiwBQdupBLQthMCHKV7zv56uv.jpg"
    },
    {
      "title": "No Country for Old Men",
      "overview": "Llewelyn Moss stumbles upon dead bodies, $2 million and a hoard of heroin in a Texas desert, but methodical killer Anton Chigurh comes looking for it, with local sheriff Ed Tom Bell hot on his trail. The roles of prey and predator blur as the violent pursuit of money and justice collide.",
      "rating": 7.9,
      "release_date": "2007-06-13",
      "poster_url": "https://image.tmdb.org/t/p/w500/bj1v6YKF8yHqA489VFfnQvOJpnc.jpg"
    },
    {
      "title": "Cape Fear",
      "overview": "Sam Bowden is a small-town corporate attorney. Max Cady is a tattooed, cigar-smoking, Bible-quoting, psychotic rapist. What do they have in common? 14 years ago, Sam was a public defender assigned to Max Cady's rape trial, and he made a serious error: he hid a document from his illiterate client that could have gotten him acquitted. Now, the cagey Cady has been released, and he intends to teach Sam Bowden and his family a thing or two about loss.",
      "rating": 7.256,
      "release_date": "1991-11-13",
      "poster_url": "https://image.tmdb.org/t/p/w500/meJZAAuVcjic2ipvbOPz5UlE4P9.jpg"
    },
    {
      "title": "American History X",
      "overview": "Derek Vineyard is paroled after serving 3 years in prison for killing two African-American men. Through his brother, Danny Vineyard's narration, we learn that before going to prison, Derek was a skinhead and the leader of a violent white supremacist gang that committed acts of racial crime throughout L.A. and his actions greatly influenced Danny. Reformed and fresh out of prison, Derek severs contact with the gang and becomes determined to keep Danny from going down the same violent path as he did.",
      "rating": 8.338,
      "release_date": "1998-07-01",
      "poster_url": "https://image.tmdb.org/t/p/w500/euypWkaYFOLW3e5rLIcTAjWnhhT.jpg"
    },
    {
      "title": "The Hateful Eight",
      "overview": "Bounty hunters seek shelter from a raging blizzard and get caught up in a plot of betrayal and deception.",
      "rating": 7.755,
      "release_date": "2015-12-25",
      "poster_url": "https://image.tmdb.org/t/p/w500/jIywvdPjia2t3eKYbjVTcwBQlG8.jpg"
    },
    {
      "title": "Blue Ruin",
      "overview": "When the quiet life of a beach bum is upended by dreadful news, he sets off for his childhood home to carry out an act of vengeance. However, he proves an inept assassin and finds himself in a brutal fight to protect his estranged family.",
      "rating": 6.795,
      "release_date": "2014-04-25",
      "poster_url": "https://image.tmdb.org/t/p/w500/q0itEsso2drJXqH9kfdidxIT5dF.jpg"
    },
    {
      "title": "You Were Never Really Here",
      "overview": "A traumatized veteran, unafraid of violence, tracks down missing girls for a living. When a job spins out of control, his nightmares begin to overtake him, and a conspiracy is uncovered—leading to what may be his death trip or his awakening.",
      "rating": 6.548,
      "release_date": "2017-11-08",
      "poster_url": "https://image.tmdb.org/t/p/w500/nx4lUyQNEzJowcF55VAP0TQEaX0.jpg"
    },
    {
      "title": "Peppermint",
      "overview": "A grieving mother transforms herself into a vigilante following the murders of her husband and daughter, eluding the authorities to deliver her own personal brand of justice.",
      "rating": 6.721,
      "release_date": "2018-09-06",
      "poster_url": "https://image.tmdb.org/t/p/w500/jrzxS0vcbzIIay1sdYm0rgI2QfJ.jpg"
    },
    {
      "title": "Hardcore Henry",
      "overview": "Henry, a newly resurrected cyborg who must save his wife/creator from the clutches of a psychotic tyrant with telekinetic powers, AKAN, and his army of mercenaries. Fighting alongside Henry is Jimmy, who is Henry's only hope to make it through the day. Hardcore Henry takes place over the course of one day, in Moscow, Russia.",
      "rating": 6.395,
      "release_date": "2015-09-12",
      "poster_url": "https://image.tmdb.org/t/p/w500/ik1uZyiMSxF9HqrgRKUNfMCfr3z.jpg"
    },
    {
      "title": "The Night Comes for Us",
      "overview": "After sparing a girl's life during a massacre, an elite Triad assassin is targeted by an onslaught of murderous gangsters.",
      "rating": 6.898,
      "release_date": "2018-10-05",
      "poster_url": "https://image.tmdb.org/t/p/w500/8lI1p5cPqgXN2qrKZrmI3mhKBfs.jpg"
    },
    {
      "title": "Nobody",
      "overview": "Hutch Mansell, a suburban dad, overlooked husband, nothing neighbor — a \"nobody.\" When two thieves break into his home one night, Hutch's unknown long-simmering rage is ignited and propels him on a brutal path that will uncover dark secrets he fought to leave behind.",
      "rating": 7.926,
      "release_date": "2021-03-18",
      "poster_url": "https://image.tmdb.org/t/p/w500/oBgWY00bEFeZ9N25wWVyuQddbAo.jpg"
    }
  ],
  "Inspirational": [
    {
      "title": "The Pursuit of Happyness",
      "overview": "A struggling salesman takes custody of his son as he's poised to begin a life-changing professional career.",
      "rating": 7.9,
      "release_date": "2006-12-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/lBYOKAMcxIvuk9s9hMuecB9dPBV.jpg"
    },
    {
      "title": "Schindler's List",
      "overview": "The true story of how businessman Oskar Schindler saved over a thousand Jewish lives from the Nazis while they worked as slaves in his factory during World War II.",
      "rating": 8.565,
      "release_date": "1993-12-15",
      "poster_url": "https://image.tmdb.org/t/p/w500/sF1U4EUQS8YHUYjNl3pMGNIQyr0.jpg"
    },
    {
      "title": "12 Years a Slave",
      "overview": "In the pre-Civil War United States, Solomon Northup, a free black man from upstate New York, is abducted and sold into slavery. Facing cruelty as well as unexpected kindnesses Solomon struggles not only to stay alive, but to retain his dignity. In the twelfth year of his unforgettable odyssey, Solomon’s chance meeting with a Canadian abolitionist will forever alter his life.",
      "rating": 7.937,
      "release_date": "2013-10-18",
      "poster_url": "https://image.tmdb.org/t/p/w500/xdANQijuNrJaw1HA61rDccME4Tm.jpg"
    },
    {
      "title": "Good Will Hunting",
      "overview": "Headstrong yet aimless, Will Hunting has a genius-level IQ but chooses to work as a janitor at MIT. When he secretly solves highly difficult graduate-level math problems, his talents are discovered by Professor Gerald Lambeau, who decides to help the misguided youth reach his potential. When Will is arrested for attacking a police officer, Professor Lambeau makes a deal to get leniency for him if he gets court-ordered therapy. Eventually, therapist Dr. Sean Maguire helps Will confront the demons that are holding him back.",
      "rating": 8.158,
      "release_date": "1997-12-05",
      "poster_url": "https://image.tmdb.org/t/p/w500/z2FnLKpFi1HPO7BEJxdkv6hpJSU.jpg"
    },
    {
      "title": "A Beautiful Mind",
      "overview": "From the heights of notoriety to the depths of depravity, John Forbes Nash Jr. experiences it all. As a brilliant but socially awkward mathematician, he made a groundbreaking discovery early in his career and stands on the brink of international acclaim. But as the handsome and arrogant Nash accepts secret work in cryptography, he becomes entangled in a mysterious conspiracy. His life takes a nightmarish turn and he soon finds himself on a painful and harrowing journey of self-discovery.",
      "rating": 7.854,
      "release_date": "2001-12-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/rEIg5yJdNOt9fmX4P8gU9LeNoTQ.jpg"
    },
    {
      "title": "Forrest Gump",
      "overview": "A man with a low IQ has accomplished great things in his life and been present during significant historic events—in each case, far exceeding what anyone imagined he could do. But despite all he has achieved, his one true love eludes him.",
      "rating": 8.468,
      "release_date": "1994-06-23",
      "poster_url": "https://image.tmdb.org/t/p/w500/arw2vcBveWOVZr6pxd9XTd1TdQa.jpg"
    },
    {
      "title": "Dead Poets Society",
      "overview": "At an elite, old-fashioned boarding school in New England, a passionate English teacher inspires his students to rebel against convention and seize the potential of every day, courting the disdain of the stern headmaster.",
      "rating": 8.302,
      "release_date": "1989-06-02",
      "poster_url": "https://image.tmdb.org/t/p/w500/erzbMlcNHOdx24AXOcn2ZKA7R1q.jpg"
    },
    {
      "title": "The Theory of Everything",
      "overview": "The Theory of Everything is the extraordinary story of one of the world’s greatest living minds, the renowned astrophysicist Stephen Hawking, who falls deeply in love with fellow Cambridge student Jane Wilde.",
      "rating": 7.843,
      "release_date": "2014-11-07",
      "poster_url": "https://image.tmdb.org/t/p/w500/kJuL37NTE51zVP3eG5aGMyKAIlh.jpg"
    },
    {
      "title": "Hidden Figures",
      "overview": "The untold story of Katherine G. Johnson, Dorothy Vaughan and Mary Jackson – brilliant African-American women working at NASA and serving as the brains behind one of the greatest operations in history – the launch of astronaut John Glenn into orbit. The visionary trio crossed all gender and race lines to inspire generations to dream big.",
      "rating": 8.055,
      "release_date": "2016-12-10",
      "poster_url": "https://image.tmdb.org/t/p/w500/9lfz2W2uGjyow3am00rsPJ8iOyq.jpg"
    },
    {
      "title": "Erin Brockovich",
      "overview": "A twice-divorced mother of three who sees an injustice, takes on the bad guy and wins -- with a little help from her push-up bra. Erin goes to work for an attorney and comes across medical records describing illnesses clustered in one nearby town. She starts investigating and soon exposes a monumental cover-up.",
      "rating": 7.439,
      "release_date": "2000-03-17",
      "poster_url": "https://image.tmdb.org/t/p/w500/jEMvWBWVjndZT0vJnLrRWi9ajea.jpg"
    },
    {
      "title": "The Imitation Game",
      "overview": "Based on the real life story of legendary cryptanalyst Alan Turing, the film portrays the nail-biting race against time by Turing and his brilliant team of code-breakers at Britain's top-secret Government Code and Cypher School at Bletchley Park, during the darkest days of World War II.",
      "rating": 7.994,
      "release_date": "2014-11-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/zSqJ1qFq8NXFfi7JeIYMlzyR0dx.jpg"
    },
    {
      "title": "Lion",
      "overview": "A five-year-old Indian boy gets lost on the streets of Calcutta, thousands of kilometers from home. He survives many challenges before being adopted by a couple in Australia; 25 years later, he sets out to find his lost family.",
      "rating": 8.047,
      "release_date": "2016-11-24",
      "poster_url": "https://image.tmdb.org/t/p/w500/iBGRbLvg6kVc7wbS8wDdVHq6otm.jpg"
    },
    {
      "title": "Slumdog Millionaire",
      "overview": "A teenager reflects on his life after being accused of cheating on the Indian version of \"Who Wants to be a Millionaire?\".",
      "rating": 7.732,
      "release_date": "2008-11-12",
      "poster_url": "https://image.tmdb.org/t/p/w500/5leCCi7ZF0CawAfM5Qo2ECKPprc.jpg"
    },
    {
      "title": "Hotel Rwanda",
      "overview": "Inspired by true events, this film takes place in Rwanda in the 1990s when more than a million Tutsis were killed in a genocide that went mostly unnoticed by the rest of the world. Hotel owner Paul Rusesabagina houses over a thousand refuges in his hotel in attempt to save their lives.",
      "rating": 7.713,
      "release_date": "2004-12-22",
      "poster_url": "https://image.tmdb.org/t/p/w500/lOBsGSCBEZNdsiCNpoSG2S6xrdN.jpg"
    },
    {
      "title": "The Blind Side",
      "overview": "The story of Michael Oher, a homeless and traumatized boy who became an All American football player and first round NFL draft pick with the help of a caring woman and her family.",
      "rating": 7.67,
      "release_date": "2009-11-20",
      "poster_url": "https://image.tmdb.org/t/p/w500/bMgq7VBriuBFknXEe9E9pVBYGZq.jpg"
    },
    {
      "title": "The Pianist",
      "overview": "The true story of pianist Władysław Szpilman's experiences in Warsaw during the Nazi occupation. When the Jews of the city find themselves forced into a ghetto, Szpilman finds work playing in a café; and when his family is deported in 1942, he stays behind, works for a while as a laborer, and eventually goes into hiding in the ruins of the war-torn city.",
      "rating": 8.379,
      "release_date": "2002-09-17",
      "poster_url": "https://image.tmdb.org/t/p/w500/2hFvxCCWrTmCYwfy7yum0GKRi3Y.jpg"
    },
    {
      "title": "The Help",
      "overview": "Aibileen Clark is a middle-aged African-American maid who has spent her life raising white children and has recently lost her only son; Minny Jackson is an African-American maid who has often offended her employers despite her family's struggles with money and her desperate need for jobs; and Eugenia \"Skeeter\" Phelan is a young white woman who has recently moved back home after graduating college to find out her childhood maid has mysteriously disappeared. These three stories intertwine to explain how life in Jackson, Mississippi revolves around \"the help\"; yet they are always kept at a certain distance because of racial lines.",
      "rating": 8.207,
      "release_date": "2011-08-09",
      "poster_url": "https://image.tmdb.org/t/p/w500/3kmfoWWEc9Vtyuaf9v5VipRgdjx.jpg"
    },
    {
      "title": "127 Hours",
      "overview": "The true story of mountain climber Aron Ralston's remarkable adventure to save himself after a fallen boulder crashes on his arm and traps him in an isolated canyon in Utah.",
      "rating": 7.081,
      "release_date": "2010-11-12",
      "poster_url": "https://image.tmdb.org/t/p/w500/h0RMdn0rfl9l5hWXz3tUh6QVkhi.jpg"
    },
    {
      "title": "Freedom Writers",
      "overview": "A young teacher inspires her class of at-risk students to learn tolerance, apply themselves, and pursue education beyond high school.",
      "rating": 7.921,
      "release_date": "2007-01-05",
      "poster_url": "https://image.tmdb.org/t/p/w500/81AdeUQT99N0xPg3j6RVh0YGOTk.jpg"
    },
    {
      "title": "The King's Speech",
      "overview": "The King's Speech tells the story of the man who became King George VI, the father of Queen Elizabeth II. After his brother abdicates, George ('Bertie') reluctantly assumes the throne. Plagued by a dreaded stutter and considered unfit to be king, Bertie engages the help of an unorthodox speech therapist named Lionel Logue. Through a set of unexpected techniques, and as a result of an unlikely friendship, Bertie is able to find his voice and boldly lead the country into war.",
      "rating": 7.734,
      "release_date": "2010-11-26",
      "poster_url": "https://image.tmdb.org/t/p/w500/pVNKXVQFukBaCz6ML7GH3kiPlQP.jpg"
    },
    {
      "title": "Invictus",
      "overview": "Newly elected President Nelson Mandela knows his nation remains racially and economically divided in the wake of apartheid. Believing he can bring his people together through the universal language of sport, Mandela rallies South Africa's rugby union team as they make their historic run to the 1995 Rugby World Cup Championship match.",
      "rating": 7.181,
      "release_date": "2009-12-11",
      "poster_url": "https://image.tmdb.org/t/p/w500/runuhBAAX7PmdjGhqRKCyl4bh7z.jpg"
    },
    {
      "title": "The Boy Who Harnessed the Wind",
      "overview": "Against all the odds, a thirteen year old boy in Malawi invents an unconventional way to save his family and village from famine.",
      "rating": 7.902,
      "release_date": "2019-02-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/yOr7RxHw15MMXNxGMXSmngDqHyI.jpg"
    },
    {
      "title": "The Walk",
      "overview": "Pilgrimage or purgatory? Every Wednesday Amar endures a 24-mile round trip on foot to the JobCentre and back to sign on.",
      "rating": 5,
      "release_date": "2023-10-04",
      "poster_url": "https://image.tmdb.org/t/p/w500/2VGYWOjgNs6Vk8Dd8mnhijrPZyV.jpg"
    },
    {
      "title": "Soul Surfer",
      "overview": "The true story of teen surfer Bethany Hamilton, who lost her arm in a shark attack and courageously overcame all odds to become a champion again, through her sheer determination and unwavering faith.",
      "rating": 7.014,
      "release_date": "2011-04-08",
      "poster_url": "https://image.tmdb.org/t/p/w500/cvgRxrEupUFeJ0xzUExJo4dMXbL.jpg"
    },
    {
      "title": "The Greatest Showman",
      "overview": "The story of American showman P.T. Barnum, founder of the circus that became the famous traveling Ringling Bros. and Barnum & Bailey Circus.",
      "rating": 7.877,
      "release_date": "2017-12-20",
      "poster_url": "https://image.tmdb.org/t/p/w500/b9CeobiihCx1uG1tpw8hXmpi7nm.jpg"
    },
    {
      "title": "The Diving Bell and the Butterfly",
      "overview": "The true story of Elle France editor Jean-Dominique Bauby, who, in 1995 at the age of 43, suffered a stroke that paralyzed his entire body, except his left eye. Using that eye to blink out his memoir, Bauby eloquently described the aspects of his interior world, from the psychological torment of being trapped inside his body to his imagined stories from lands he'd only visited in his mind.",
      "rating": 7.6,
      "release_date": "2007-05-23",
      "poster_url": "https://image.tmdb.org/t/p/w500/3MJUo4bCPai5r9zrw7nTS8sVzQ7.jpg"
    },
    {
      "title": "October Sky",
      "overview": "Homer Hickam is a kid with only one future in sight, to work in the local coal mine like his father. However, in October 1957 everything changes when the first artificial satellite, Sputnik, goes into orbit. When Homer sees the Soviet satellite streak overhead, he becomes inspired to learn how to build rockets. With the help of his friends, and the local nerd, Homer sets to do just that by trial and a lot of error. Unfortunately, most of the town, and especially Homer's father, thinks that they are wasting their time. Only one teacher understands their efforts and lets them know that they could become contenders in the national science fair with college scholarships being the prize. Now the gang must learn to perfect their craft and overcome the many problems facing them as they shoot for the stars.",
      "rating": 7.666,
      "release_date": "1999-02-19",
      "poster_url": "https://image.tmdb.org/t/p/w500/1weUnrWqESWoLzMgSs64jd4GEwY.jpg"
    },
    {
      "title": "Rocketman",
      "overview": "The story of Elton John's life, from his years as a prodigy at the Royal Academy of Music through his influential and enduring musical partnership with Bernie Taupin.",
      "rating": 7.322,
      "release_date": "2019-05-17",
      "poster_url": "https://image.tmdb.org/t/p/w500/f4FF18ia7yTvHf2izNrHqBmgH8U.jpg"
    },
    {
      "title": "Bohemian Rhapsody",
      "overview": "Singer Freddie Mercury, guitarist Brian May, drummer Roger Taylor and bass guitarist John Deacon take the music world by storm when they form the rock 'n' roll band Queen in 1970. Hit songs become instant classics. When Mercury's increasingly wild lifestyle starts to spiral out of control, Queen soon faces its greatest challenge yet – finding a way to keep the band together amid the success and excess.",
      "rating": 7.976,
      "release_date": "2018-10-24",
      "poster_url": "https://image.tmdb.org/t/p/w500/lHu1wtNaczFPGFDTrjCSzeLPTKN.jpg"
    },
    {
      "title": "Mandela: Long Walk to Freedom",
      "overview": "A chronicle of Nelson Mandela's life journey from his childhood in a rural village through to his inauguration as the first democratically elected president of South Africa.",
      "rating": 6.871,
      "release_date": "2013-11-28",
      "poster_url": "https://image.tmdb.org/t/p/w500/nzjwDSwLbalv7bCXnFbkAuIxXLx.jpg"
    }
  ],
  "Fun": [
    {
      "title": "Jumanji: Welcome to the Jungle",
      "overview": "Four teenagers in detention discover an old video game console with a game they’ve never heard of. When they decide to play, they are immediately sucked into the jungle world of Jumanji in the bodies of their avatars. They’ll have to complete the adventure of their lives filled with fun, thrills and danger or be stuck in the game forever!",
      "rating": 6.82,
      "release_date": "2017-12-09",
      "poster_url": "https://image.tmdb.org/t/p/w500/pSgXKPU5h6U89ipF7HBYajvYt7j.jpg"
    },
    {
      "title": "Pirates of the Caribbean: The Curse of the Black Pearl",
      "overview": "After Port Royal is attacked and pillaged by a mysterious pirate crew, capturing the governor's daughter Elizabeth Swann in the process, William Turner asks free-willing pirate Jack Sparrow to help him locate the crew's ship—The Black Pearl—so that he can rescue the woman he loves.",
      "rating": 7.809,
      "release_date": "2003-07-09",
      "poster_url": "https://image.tmdb.org/t/p/w500/z8onk7LV9Mmw6zKz4hT6pzzvmvl.jpg"
    },
    {
      "title": "Shrek",
      "overview": "It ain't easy bein' green -- especially if you're a likable (albeit smelly) ogre named Shrek. On a mission to retrieve a gorgeous princess from the clutches of a fire-breathing dragon, Shrek teams up with an unlikely compatriot -- a wisecracking donkey.",
      "rating": 7.75,
      "release_date": "2001-05-18",
      "poster_url": "https://image.tmdb.org/t/p/w500/iB64vpL3dIObOtMZgX3RqdVdQDc.jpg"
    },
    {
      "title": "Despicable Me",
      "overview": "Villainous Gru lives up to his reputation as a despicable, deplorable and downright unlikable guy when he hatches a plan to steal the moon from the sky. But he has a tough time staying on task after three orphans land in his care.",
      "rating": 7.248,
      "release_date": "2010-07-08",
      "poster_url": "https://image.tmdb.org/t/p/w500/9lOloREsAhBu0pEtU0BgeR1rHyo.jpg"
    },
    {
      "title": "Zombieland",
      "overview": "Columbus has made a habit of running from what scares him. Tallahassee doesn't have fears. If he did, he'd kick their ever-living ass. In a world overrun by zombies, these two are perfectly evolved survivors. But now, they're about to stare down the most terrifying prospect of all: each other.",
      "rating": 7.26,
      "release_date": "2009-10-02",
      "poster_url": "https://image.tmdb.org/t/p/w500/dUkAmAyPVqubSBNRjRqCgHggZcK.jpg"
    },
    {
      "title": "Scott Pilgrim vs. the World",
      "overview": "As bass guitarist for a garage-rock band, Scott Pilgrim has never had trouble getting a girlfriend; usually, the problem is getting rid of them. But when Ramona Flowers skates into his heart, he finds she has the most troublesome baggage of all: an army of ex-boyfriends who will stop at nothing to eliminate him from her list of suitors.",
      "rating": 7.488,
      "release_date": "2010-08-12",
      "poster_url": "https://image.tmdb.org/t/p/w500/g5IoYeudx9XBEfwNL0fHvSckLBz.jpg"
    },
    {
      "title": "Back to the Future",
      "overview": "Eighties teenager Marty McFly is accidentally sent back in time to 1955, inadvertently disrupting his parents' first meeting and attracting his mother's romantic interest. Marty must repair the damage to history by rekindling his parents' romance and - with the help of his eccentric inventor friend Doc Brown - return to 1985.",
      "rating": 8.319,
      "release_date": "1985-07-03",
      "poster_url": "https://image.tmdb.org/t/p/w500/vN5B5WgYscRGcQpVhHl6p9DDTP0.jpg"
    },
    {
      "title": "Men in Black",
      "overview": "After a police chase with an otherworldly being, a New York City cop is recruited as an agent in a top-secret organization established to monitor and police alien activity on Earth: the Men in Black. Agent K and new recruit Agent J find themselves in the middle of a deadly plot by an intergalactic terrorist who has arrived on Earth to assassinate two ambassadors from opposing galaxies.",
      "rating": 7.206,
      "release_date": "1997-07-02",
      "poster_url": "https://image.tmdb.org/t/p/w500/uLOmOF5IzWoyrgIF5MfUnh5pa1X.jpg"
    },
    {
      "title": "The Lego Movie",
      "overview": "An ordinary Lego mini-figure, mistakenly thought to be the extraordinary MasterBuilder, is recruited to join a quest to stop an evil Lego tyrant from conquering the universe.",
      "rating": 7.415,
      "release_date": "2014-02-06",
      "poster_url": "https://image.tmdb.org/t/p/w500/lbctonEnewCYZ4FYoTZhs8cidAl.jpg"
    },
    {
      "title": "Kung Fu Panda",
      "overview": "When the Valley of Peace is threatened, lazy Po the panda discovers his destiny as the \"chosen one\" and trains to become a kung fu hero, but transforming the unsleek slacker into a brave warrior won't be easy. It's up to Master Shifu and the Furious Five -- Tigress, Crane, Mantis, Viper and Monkey -- to give it a try.",
      "rating": 7.299,
      "release_date": "2008-06-04",
      "poster_url": "https://image.tmdb.org/t/p/w500/wWt4JYXTg5Wr3xBW2phBrMKgp3x.jpg"
    },
    {
      "title": "Night at the Museum",
      "overview": "Chaos reigns at the natural history museum when night watchman Larry Daley accidentally stirs up an ancient curse, awakening Attila the Hun, an army of gladiators, a Tyrannosaurus rex and other exhibits.",
      "rating": 6.587,
      "release_date": "2006-12-20",
      "poster_url": "https://image.tmdb.org/t/p/w500/pDsAAYf6Zn0yiAGJ6lYGs6hoZ4E.jpg"
    },
    {
      "title": "Deadpool",
      "overview": "The origin story of former Special Forces operative turned mercenary Wade Wilson, who, after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with his new abilities and a dark, twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life.",
      "rating": 7.6,
      "release_date": "2016-02-09",
      "poster_url": "https://image.tmdb.org/t/p/w500/3E53WEZJqP6aM84D8CckXx4pIHw.jpg"
    },
    {
      "title": "Guardians of the Galaxy",
      "overview": "Light years from Earth, 26 years after being abducted, Peter Quill finds himself the prime target of a manhunt after discovering an orb wanted by Ronan the Accuser.",
      "rating": 7.904,
      "release_date": "2014-07-30",
      "poster_url": "https://image.tmdb.org/t/p/w500/jPrJPZKJVhvyJ4DmUTrDgmFN0yG.jpg"
    },
    {
      "title": "The Mask",
      "overview": "When timid bank clerk Stanley Ipkiss discovers a magical mask containing the spirit of the Norse god Loki, his entire life changes. While wearing the mask, Ipkiss becomes a supernatural playboy exuding charm and confidence which allows him to catch the eye of local nightclub singer Tina Carlyle. Unfortunately, under the mask's influence, Ipkiss also robs a bank, which angers junior crime lord Dorian Tyrell, whose goons get blamed for the heist.",
      "rating": 6.963,
      "release_date": "1994-07-29",
      "poster_url": "https://image.tmdb.org/t/p/w500/xbbXp9px4o8Oe7IbGd0yIbla8mZ.jpg"
    },
    {
      "title": "Spider-Man: Into the Spider-Verse",
      "overview": "Struggling to find his place in the world while juggling school and family, Brooklyn teenager Miles Morales is unexpectedly bitten by a radioactive spider and develops unfathomable powers just like the one and only Spider-Man. While wrestling with the implications of his new abilities, Miles discovers a super collider created by the madman Wilson \"Kingpin\" Fisk, causing others from across the Spider-Verse to be inadvertently transported to his dimension.",
      "rating": 8.397,
      "release_date": "2018-12-06",
      "poster_url": "https://image.tmdb.org/t/p/w500/iiZZdoQBEYBv6id8su7ImL0oCbD.jpg"
    },
    {
      "title": "Ocean's Eleven",
      "overview": "Less than 24 hours into his parole, charismatic thief Danny Ocean is already rolling out his next plan: In one night, Danny's hand-picked crew of specialists will attempt to steal more than $150 million from three Las Vegas casinos. But to score the cash, Danny risks his chances of reconciling with ex-wife, Tess.",
      "rating": 7.447,
      "release_date": "2001-12-07",
      "poster_url": "https://image.tmdb.org/t/p/w500/hQQCdZrsHtZyR6NbKH2YyCqd2fR.jpg"
    },
    {
      "title": "Tangled",
      "overview": "Feisty teenager Rapunzel, who has long and magical hair, wants to go and see sky lanterns on her eighteenth birthday, but she's bound to a tower by her overprotective mother. She strikes a deal with Flynn Rider, a charming wanted thief, and the duo set off on an action-packed escapade.",
      "rating": 7.607,
      "release_date": "2010-11-24",
      "poster_url": "https://image.tmdb.org/t/p/w500/ym7Kst6a4uodryxqbGOxmewF235.jpg"
    },
    {
      "title": "Lilo & Stitch",
      "overview": "The wildly funny and touching story of a lonely Hawaiian girl and the fugitive alien who helps to mend her broken family.",
      "rating": 0,
      "release_date": "2025-05-21",
      "poster_url": "https://image.tmdb.org/t/p/w500/3bN675X0K2E5QiAZVChzB5wq90B.jpg"
    },
    {
      "title": "The Emperor's New Groove",
      "overview": "When self-centered Emperor Kuzco is turned into a llama by his scheming advisor, he is forced to rely on good-hearted peasant Pacha to get back home.",
      "rating": 7.556,
      "release_date": "2000-12-15",
      "poster_url": "https://image.tmdb.org/t/p/w500/xU635vn1lMD9DWDloeuKmuhxxnQ.jpg"
    },
    {
      "title": "Aladdin",
      "overview": "In the boorish city of Agrabah, kind-hearted street urchin Aladdin and Princess Jasmine fall in love, although she can only marry a prince. He and power-hungry Grand Vizier Jafar vie for a magic lamp that can fulfill their wishes.",
      "rating": 7.652,
      "release_date": "1992-11-25",
      "poster_url": "https://image.tmdb.org/t/p/w500/eLFfl7vS8dkeG1hKp5mwbm37V83.jpg"
    },
    {
      "title": "Sing",
      "overview": "A koala named Buster recruits his best friend to help him drum up business for his theater by hosting a singing competition.",
      "rating": 7.114,
      "release_date": "2016-11-23",
      "poster_url": "https://image.tmdb.org/t/p/w500/zZTlF2eVVUkbdmccd3bNUU9T9sD.jpg"
    },
    {
      "title": "The Mitchells vs. the Machines",
      "overview": "A quirky, dysfunctional family's road trip is upended when they find themselves in the middle of the robot apocalypse and suddenly become humanity's unlikeliest last hope.",
      "rating": 7.886,
      "release_date": "2021-04-22",
      "poster_url": "https://image.tmdb.org/t/p/w500/mI2Di7HmskQQ34kz0iau6J1vr70.jpg"
    },
    {
      "title": "Minions",
      "overview": "Minions Stuart, Kevin and Bob are recruited by Scarlet Overkill, a super-villain who, alongside her inventor husband Herb, hatches a plot to take over the world.",
      "rating": 6.411,
      "release_date": "2015-06-17",
      "poster_url": "https://image.tmdb.org/t/p/w500/dr02BdCNAUPVU07aOodwPYv6HCf.jpg"
    },
    {
      "title": "The SpongeBob SquarePants Movie",
      "overview": "There's trouble brewing in Bikini Bottom. Someone has stolen King Neptune's crown, and it looks like Mr. Krab, SpongeBob's boss, is the culprit. Though he's just been passed over for the promotion of his dreams, SpongeBob stands by his boss, and along with his best pal Patrick, sets out on a treacherous mission to Shell City to reclaim the crown and save Mr. Krab's life.",
      "rating": 7.039,
      "release_date": "2004-11-19",
      "poster_url": "https://image.tmdb.org/t/p/w500/1rvzKV1d18EbDVaEd4VDzK3cgnY.jpg"
    },
    {
      "title": "Monsters, Inc.",
      "overview": "Lovable Sulley and his wisecracking sidekick Mike Wazowski are the top scare team at Monsters, Inc., the scream-processing factory in Monstropolis. When a little girl named Boo wanders into their world, it's the monsters who are scared silly, and it's up to Sulley and Mike to keep her out of sight and get her back home.",
      "rating": 7.843,
      "release_date": "2001-11-01",
      "poster_url": "https://image.tmdb.org/t/p/w500/qjlbN6aK1qgeg3SspFVovT2D1Me.jpg"
    },
    {
      "title": "Cloudy with a Chance of Meatballs",
      "overview": "Inventor Flint Lockwood creates a machine that makes clouds rain food, enabling the down-and-out citizens of Chewandswallow to feed themselves. But when the falling food reaches gargantuan proportions, Flint must scramble to avert disaster. Can he regain control of the machine and put an end to the wild weather before the town is destroyed?",
      "rating": 6.635,
      "release_date": "2009-09-17",
      "poster_url": "https://image.tmdb.org/t/p/w500/qhOhIKf7QEyQ5dMrRUqs5eTX1Oq.jpg"
    },
    {
      "title": "Megamind",
      "overview": "After Megamind, a highly intelligent alien supervillain, defeats his long-time nemesis Metro Man, Megamind creates a new hero to fight, but must act to save the city when his \"creation\" becomes an even worse villain than he was.",
      "rating": 7.002,
      "release_date": "2010-10-28",
      "poster_url": "https://image.tmdb.org/t/p/w500/uZ9ytt3sPTx62XTfN56ILSuYWRe.jpg"
    },
    {
      "title": "Paddington",
      "overview": "A young Peruvian bear travels to London in search of a home. Finding himself lost and alone at Paddington Station, he meets the kindly Brown family, who offer him a temporary haven.",
      "rating": 7.106,
      "release_date": "2014-11-24",
      "poster_url": "https://image.tmdb.org/t/p/w500/wpchRGhRhvhtU083PfX2yixXtiw.jpg"
    },
    {
      "title": "Free Guy",
      "overview": "A bank teller discovers he is actually a background player in an open-world video game, and decides to become the hero of his own story. Now, in a world where there are no limits, he is determined to be the guy who saves his world his way before it's too late.",
      "rating": 7.481,
      "release_date": "2021-08-11",
      "poster_url": "https://image.tmdb.org/t/p/w500/6PFJrMvoQwBxQITLYHj09VeJ37q.jpg"
    },
    {
      "title": "The Peanuts Movie",
      "overview": "Snoopy embarks upon his greatest mission as he and his team take to the skies to pursue their arch-nemesis, while his best pal Charlie Brown begins his own epic quest.",
      "rating": 6.929,
      "release_date": "2015-11-05",
      "poster_url": "https://image.tmdb.org/t/p/w500/dZOcwqxurYhDyjmdnhYcGnn1agL.jpg"
    }
  ],
  "Dark": [
    {
      "title": "Se7en",
      "overview": "Two homicide detectives are on a desperate hunt for a serial killer whose crimes are based on the \"seven deadly sins\" in this dark and haunting film that takes viewers from the tortured remains of one victim to the next. The seasoned Det. Somerset researches each sin in an effort to get inside the killer's mind, while his novice partner, Mills, scoffs at his efforts to unravel the case.",
      "rating": 8.375,
      "release_date": "1995-09-22",
      "poster_url": "https://image.tmdb.org/t/p/w500/191nKfP0ehp3uIvWqgPbFmI4lv9.jpg"
    },
    {
      "title": "Gone Girl",
      "overview": "With his wife's disappearance having become the focus of an intense media circus, a man sees the spotlight turned on him when it's suspected that he may not be innocent.",
      "rating": 7.9,
      "release_date": "2014-10-01",
      "poster_url": "https://image.tmdb.org/t/p/w500/ts996lKsxvjkO2yiYG0ht4qAicO.jpg"
    },
    {
      "title": "Prisoners",
      "overview": "Keller Dover is facing every parent’s worst nightmare. His six-year-old daughter, Anna, is missing, together with her young friend, Joy, and as minutes turn to hours, panic sets in. The only lead is a dilapidated RV that had earlier been parked on their street.",
      "rating": 8.099,
      "release_date": "2013-09-19",
      "poster_url": "https://image.tmdb.org/t/p/w500/uhviyknTT5cEQXbn6vWIqfM4vGm.jpg"
    },
    {
      "title": "Zodiac",
      "overview": "The Zodiac murders cause the lives of Paul Avery, David Toschi and Robert Graysmith to intersect.",
      "rating": 7.527,
      "release_date": "2007-03-02",
      "poster_url": "https://image.tmdb.org/t/p/w500/6YmeO4pB7XTh8P8F960O1uA14JO.jpg"
    },
    {
      "title": "Nightcrawler",
      "overview": "When Lou Bloom, desperate for work, muscles into the world of L.A. crime journalism, he blurs the line between observer and participant to become the star of his own story. Aiding him in his effort is Nina, a TV-news veteran.",
      "rating": 7.705,
      "release_date": "2014-10-23",
      "poster_url": "https://image.tmdb.org/t/p/w500/j9HrX8f7GbZQm1BrBiR40uFQZSb.jpg"
    },
    {
      "title": "Donnie Darko",
      "overview": "After narrowly escaping a bizarre accident, a troubled teenager is plagued by visions of a large bunny rabbit that manipulates him to commit a series of crimes.",
      "rating": 7.77,
      "release_date": "2001-01-19",
      "poster_url": "https://image.tmdb.org/t/p/w500/fhQoQfejY1hUcwyuLgpBrYs6uFt.jpg"
    },
    {
      "title": "Black Swan",
      "overview": "The story of Nina, a ballerina in a New York City ballet company whose life, like all those in her profession, is completely consumed with dance. She lives with her retired ballerina mother Erica who zealously supports her daughter's professional ambition. When artistic director Thomas Leroy decides to replace prima ballerina Beth MacIntyre for the opening production of their new season, Swan Lake, Nina is his first choice.",
      "rating": 7.686,
      "release_date": "2010-12-03",
      "poster_url": "https://image.tmdb.org/t/p/w500/viWheBd44bouiLCHgNMvahLThqx.jpg"
    },
    {
      "title": "The Lighthouse",
      "overview": "Two lighthouse keepers try to maintain their sanity while living on a remote and mysterious New England island in the 1890s.",
      "rating": 7.5,
      "release_date": "2019-10-18",
      "poster_url": "https://image.tmdb.org/t/p/w500/f1tIYarTbkBdIT1aW0gzelDwknv.jpg"
    },
    {
      "title": "The Sixth Sense",
      "overview": "Following an unexpected tragedy, child psychologist Malcolm Crowe meets a nine year old boy named Cole Sear, who is hiding a dark secret.",
      "rating": 7.953,
      "release_date": "1999-08-06",
      "poster_url": "https://image.tmdb.org/t/p/w500/vOyfUXNFSnaTk7Vk5AjpsKTUWsu.jpg"
    },
    {
      "title": "The Others",
      "overview": "Grace is a religious woman who lives in an old house kept dark because her two children, Anne and Nicholas, have a rare sensitivity to light. When the family begins to suspect the house is haunted, Grace fights to protect her children at any cost in the face of strange events and disturbing visions.",
      "rating": 7.6,
      "release_date": "2001-08-02",
      "poster_url": "https://image.tmdb.org/t/p/w500/p8g1vlTvpM6nr2hMMiZ1fUlKF0D.jpg"
    },
    {
      "title": "Shutter Island",
      "overview": "World War II soldier-turned-U.S. Marshal Teddy Daniels investigates the disappearance of a patient from a hospital for the criminally insane, but his efforts are compromised by troubling visions and a mysterious doctor.",
      "rating": 8.201,
      "release_date": "2010-02-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/nrmXQ0zcZUL8jFLrakWc90IR8z9.jpg"
    },
    {
      "title": "The Machinist",
      "overview": "Trevor, an insomniac lathe operator, experiences unusual occurrences at work and home. A strange man follows him everywhere, but no one else seems to notice him.",
      "rating": 7.527,
      "release_date": "2004-09-24",
      "poster_url": "https://image.tmdb.org/t/p/w500/diAYqR4xdF9Hnj7qun6DEQhRrT2.jpg"
    },
    {
      "title": "Oldboy",
      "overview": "A man has only three and a half days and limited resources to discover why he was imprisoned in a nondescript room for 20 years without any explanation.",
      "rating": 5.9,
      "release_date": "2013-11-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/iX93YdBrZA1EpGbphmjf4ARj1Za.jpg"
    },
    {
      "title": "American Psycho",
      "overview": "A wealthy New York investment banking executive hides his alternate psychopathic ego from his co-workers and friends as he escalates deeper into his illogical, gratuitous fantasies.",
      "rating": 7.403,
      "release_date": "2000-04-13",
      "poster_url": "https://image.tmdb.org/t/p/w500/9uGHEgsiUXjCNq8wdq4r49YL8A1.jpg"
    },
    {
      "title": "Fight Club",
      "overview": "A ticking-time-bomb insomniac and a slippery soap salesman channel primal male aggression into a shocking new form of therapy. Their concept catches on, with underground \"fight clubs\" forming in every town, until an eccentric gets in the way and ignites an out-of-control spiral toward oblivion.",
      "rating": 8.438,
      "release_date": "1999-10-15",
      "poster_url": "https://image.tmdb.org/t/p/w500/pB8BM7pdSp6B6Ih7QZ4DrQ3PmJK.jpg"
    },
    {
      "title": "The Girl with the Dragon Tattoo",
      "overview": "Disgraced journalist Mikael Blomkvist investigates the disappearance of a weary patriarch's niece from 40 years ago. He is aided by the pierced, tattooed, punk computer hacker named Lisbeth Salander. As they work together in the investigation, Blomkvist and Salander uncover immense corruption beyond anything they have ever imagined.",
      "rating": 7.375,
      "release_date": "2011-12-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/8bokS83zGdhaXgN9tjidUKmAftW.jpg"
    },
    {
      "title": "Memento",
      "overview": "Leonard Shelby is tracking down the man who raped and murdered his wife. The difficulty of locating his wife's killer, however, is compounded by the fact that he suffers from a rare, untreatable form of short-term memory loss. Although he can recall details of life before his accident, Leonard cannot remember what happened fifteen minutes ago, where he's going, or why.",
      "rating": 8.179,
      "release_date": "2000-10-11",
      "poster_url": "https://image.tmdb.org/t/p/w500/fKTPH2WvH8nHTXeBYBVhawtRqtR.jpg"
    },
    {
      "title": "Requiem for a Dream",
      "overview": "The drug-induced utopias of four Coney Island residents are shattered when their addictions run deep.",
      "rating": 8.015,
      "release_date": "2000-10-06",
      "poster_url": "https://image.tmdb.org/t/p/w500/nOd6vjEmzCT0k4VYqsA2hwyi87C.jpg"
    },
    {
      "title": "Hereditary",
      "overview": "Following the death of the Leigh family matriarch, Annie and her children uncover disturbing secrets about their heritage. Their daily lives are not only impacted, but they also become entangled in a chilling fate from which they cannot escape, driving them to the brink of madness.",
      "rating": 7.291,
      "release_date": "2018-06-07",
      "poster_url": "https://image.tmdb.org/t/p/w500/4GFPuL14eXi66V96xBWY73Y9PfR.jpg"
    },
    {
      "title": "Mulholland Drive",
      "overview": "Blonde Betty Elms has only just arrived in Hollywood to become a movie star when she meets an enigmatic brunette with amnesia. Meanwhile, as the two set off to solve the second woman's identity, filmmaker Adam Kesher runs into ominous trouble while casting his latest project.",
      "rating": 7.806,
      "release_date": "2001-06-06",
      "poster_url": "https://image.tmdb.org/t/p/w500/x7A59t6ySylr1L7aubOQEA480vM.jpg"
    },
    {
      "title": "Enemy",
      "overview": "A mild-mannered college professor discovers a look-alike actor and delves into the other man's private affairs.",
      "rating": 6.863,
      "release_date": "2014-03-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/vf40tyDRKZsBmaLsYeopzfFLzLx.jpg"
    },
    {
      "title": "The Chronicles of Narnia: The Lion, the Witch and the Wardrobe",
      "overview": "Siblings Lucy, Edmund, Susan and Peter step through a magical wardrobe and find the land of Narnia. There, they discover a charming, once peaceful kingdom that has been plunged into eternal winter by the evil White Witch, Jadis. Aided by the wise and magnificent lion, Aslan, the children lead Narnia into a spectacular, climactic battle to be free of the Witch's glacial powers forever.",
      "rating": 7.133,
      "release_date": "2005-12-07",
      "poster_url": "https://image.tmdb.org/t/p/w500/iREd0rNCjYdf5Ar0vfaW32yrkm.jpg"
    },
    {
      "title": "Antichrist",
      "overview": "A grieving couple retreats to their cabin 'Eden' in the woods, hoping to repair their broken hearts and troubled marriage. But nature takes its course and things go from bad to worse.",
      "rating": 6.6,
      "release_date": "2009-05-20",
      "poster_url": "https://image.tmdb.org/t/p/w500/ge7zbYvpfsDP3luKi0iSpzOgncM.jpg"
    },
    {
      "title": "Under the Skin",
      "overview": "A seductive stranger prowls the streets of Glasgow in search of prey: unsuspecting men who fall under her spell.",
      "rating": 6.14,
      "release_date": "2014-03-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/55wmcXJIDYITr7JDijJTdvwSaAv.jpg"
    },
    {
      "title": "Pan's Labyrinth",
      "overview": "Living with her tyrannical stepfather in a new home with her pregnant mother, 10-year-old Ofelia feels alone until she explores a decaying labyrinth guarded by a mysterious faun who claims to know her destiny. If she wishes to return to her real father, Ofelia must complete three terrifying tasks.",
      "rating": 7.752,
      "release_date": "2006-10-11",
      "poster_url": "https://image.tmdb.org/t/p/w500/s8C4whhKtDaJvMDcyiMvx3BIF5F.jpg"
    },
    {
      "title": "The Babadook",
      "overview": "A single mother, plagued by the violent death of her husband, battles with her son's fear of a monster lurking in the house, but soon discovers a sinister presence all around her.",
      "rating": 6.517,
      "release_date": "2014-05-22",
      "poster_url": "https://image.tmdb.org/t/p/w500/qt3fqapeo94TfvMyld8P7gkpXLz.jpg"
    },
    {
      "title": "Come and See",
      "overview": "The invasion of a village in Byelorussia by German forces sends young Florya into the forest to join the weary Resistance fighters, against his family's wishes. There he meets a girl, Glasha, who accompanies him back to his village. On returning home, Florya finds his family and fellow peasants massacred. His continued survival amidst the brutal debris of war becomes increasingly nightmarish, a battle between despair and hope.",
      "rating": 8.236,
      "release_date": "1985-10-17",
      "poster_url": "https://image.tmdb.org/t/p/w500/qNbMsKVzigERgJUbwf8pKyZogpb.jpg"
    },
    {
      "title": "My Mother’s Friend 2",
      "overview": "Tai Run is not satisfied with the cohabitation of his father who has been living again after two months of divorce and his young and sexy stepmother. But due to the failure of my father's career and living alone with my stepmother, she began to become more and more like a woman. The two, who were getting closer and closer, eventually fell into an irreparable desire.",
      "rating": 7,
      "release_date": "2019-04-12",
      "poster_url": "https://image.tmdb.org/t/p/w500/mIN2PxRJd951ZKo4Vnf4NFzhcDB.jpg"
    },
    {
      "title": "The Killing of a Sacred Deer",
      "overview": "Dr. Steven Murphy is a renowned cardiovascular surgeon who presides over a spotless household with his wife and two children. Lurking at the margins of his idyllic suburban existence is Martin, a fatherless teen who insinuates himself into the doctor's life in gradually unsettling ways.",
      "rating": 7.019,
      "release_date": "2017-10-20",
      "poster_url": "https://image.tmdb.org/t/p/w500/e4DGlsc9g0h5AyoyvvAuIRnofN7.jpg"
    },
    {
      "title": "Blue Velvet",
      "overview": "The discovery of a severed human ear found in a field leads a young man on an investigation related to a beautiful, mysterious nightclub singer and a group of psychopathic criminals who have kidnapped her child.",
      "rating": 7.614,
      "release_date": "1986-09-19",
      "poster_url": "https://image.tmdb.org/t/p/w500/tzXuURjPzCqtA6eL0Cswq9wzFx0.jpg"
    }
  ],
  "Feel-good": [
    {
      "title": "Forrest Gump",
      "overview": "A man with a low IQ has accomplished great things in his life and been present during significant historic events—in each case, far exceeding what anyone imagined he could do. But despite all he has achieved, his one true love eludes him.",
      "rating": 8.468,
      "release_date": "1994-06-23",
      "poster_url": "https://image.tmdb.org/t/p/w500/arw2vcBveWOVZr6pxd9XTd1TdQa.jpg"
    },
    {
      "title": "The Intouchables",
      "overview": "A true story of two men who should never have met – a quadriplegic aristocrat who was injured in a paragliding accident and a young man from the projects.",
      "rating": 0,
      "release_date": "",
      "poster_url": "https://image.tmdb.org/t/p/w500null"
    },
    {
      "title": "Paddington 2",
      "overview": "Paddington, now happily settled with the Browns, picks up a series of odd jobs to buy the perfect present for his Aunt Lucy, but it is stolen.",
      "rating": 7.465,
      "release_date": "2017-11-09",
      "poster_url": "https://image.tmdb.org/t/p/w500/1OJ9vkD5xPt3skC6KguyXAgagRZ.jpg"
    },
    {
      "title": "The Secret Life of Walter Mitty",
      "overview": "A timid magazine photo manager who lives life vicariously through daydreams embarks on a true-life adventure when a negative goes missing.",
      "rating": 7.197,
      "release_date": "2013-12-18",
      "poster_url": "https://image.tmdb.org/t/p/w500/tY6ypjKOOtujhxiSwTmvA4OZ5IE.jpg"
    },
    {
      "title": "Julie & Julia",
      "overview": "Julia Child and Julie Powell – both of whom wrote memoirs – find their lives intertwined. Though separated by time and space, both women are at loose ends... until they discover that with the right combination of passion, fearlessness and butter, anything is possible.",
      "rating": 6.705,
      "release_date": "2009-08-06",
      "poster_url": "https://image.tmdb.org/t/p/w500/r1bFBBj3VMek0oEtgm9N51OqVjF.jpg"
    },
    {
      "title": "The Hundred-Foot Journey",
      "overview": "A story centered around an Indian family who moves to France and opens a restaurant across the street from a Michelin-starred French restaurant.",
      "rating": 7.292,
      "release_date": "2014-08-06",
      "poster_url": "https://image.tmdb.org/t/p/w500/1vFhSr7INoulu18smHqicft05i8.jpg"
    },
    {
      "title": "Chef",
      "overview": "When Chef Carl Casper suddenly quits his job at a prominent Los Angeles restaurant after refusing to compromise his creative integrity for its controlling owner, he is left to figure out what's next. Finding himself in Miami, he teams up with his ex-wife, his friend and his son to launch a food truck. Taking to the road, Chef Carl goes back to his roots to reignite his passion for the kitchen -- and zest for life and love.",
      "rating": 7.112,
      "release_date": "2014-05-08",
      "poster_url": "https://image.tmdb.org/t/p/w500/hyp8EXDmO4dSC8V6Q5jU7gD1kcg.jpg"
    },
    {
      "title": "The Peanut Butter Falcon",
      "overview": "A down-on-his-luck crab fisherman embarks on a journey to get a young man with Down syndrome to a professional wrestling school in rural North Carolina and away from the retirement home where he’s lived for the past two and a half years.",
      "rating": 7.416,
      "release_date": "2019-08-09",
      "poster_url": "https://image.tmdb.org/t/p/w500/qyQcRGvdW3VtxHR4fSDgPOePEip.jpg"
    },
    {
      "title": "Amélie",
      "overview": "At a tiny Parisian café, the adorable yet painfully shy Amélie accidentally discovers a gift for helping others. Soon Amelie is spending her days as a matchmaker, guardian angel, and all-around do-gooder. But when she bumps into a handsome stranger, will she find the courage to become the star of her very own love story?",
      "rating": 7.913,
      "release_date": "2001-04-25",
      "poster_url": "https://image.tmdb.org/t/p/w500/oTKduWL2tpIKEmkAqF4mFEAWAsv.jpg"
    },
    {
      "title": "Little Miss Sunshine",
      "overview": "A family loaded with quirky, colorful characters piles into an old van and road trips to California for little Olive to compete in a beauty pageant.",
      "rating": 7.693,
      "release_date": "2006-07-26",
      "poster_url": "https://image.tmdb.org/t/p/w500/wKn7AJw730emlmzLSmJtzquwaeW.jpg"
    },
    {
      "title": "About Time",
      "overview": "The night after another unsatisfactory New Year's party, Tim's father tells his son that the men in his family have always had the ability to travel through time. They can't change history, but they can change what happens and has happened in their own lives. Thus begins the start of a lesson in learning to appreciate life itself as it is, as it comes, and most importantly, the people living alongside us.",
      "rating": 7.916,
      "release_date": "2013-09-04",
      "poster_url": "https://image.tmdb.org/t/p/w500/iR1bVfURbN7r1C46WHFbwCkVve.jpg"
    },
    {
      "title": "Soul",
      "overview": "Joe Gardner is a middle school teacher with a love for jazz music. After a successful audition at the Half Note Club, he suddenly gets into an accident that separates his soul from his body and is transported to the You Seminar, a center in which souls develop and gain passions before being transported to a newborn child. Joe must enlist help from the other souls-in-training, like 22, a soul who has spent eons in the You Seminar, in order to get back to Earth.",
      "rating": 8.11,
      "release_date": "2020-12-25",
      "poster_url": "https://image.tmdb.org/t/p/w500/pEz5aROvfy5FBW1OTlrDO3VryWO.jpg"
    },
    {
      "title": "La La Land",
      "overview": "Mia, an aspiring actress, serves lattes to movie stars in between auditions and Sebastian, a jazz musician, scrapes by playing cocktail party gigs in dingy bars, but as success mounts they are faced with decisions that begin to fray the fragile fabric of their love affair, and the dreams they worked so hard to maintain in each other threaten to rip them apart.",
      "rating": 7.9,
      "release_date": "2016-12-01",
      "poster_url": "https://image.tmdb.org/t/p/w500/uDO8zWDhfWwoFdKS4fzkUJt0Rf0.jpg"
    },
    {
      "title": "The Intern",
      "overview": "70-year-old widower Ben Whittaker has discovered that retirement isn't all it's cracked up to be. Seizing an opportunity to get back in the game, he becomes a senior intern at an online fashion site, founded and run by Jules Ostin.",
      "rating": 7.221,
      "release_date": "2015-09-23",
      "poster_url": "https://image.tmdb.org/t/p/w500/9UoAC9tu8kIyRy8AcJnGhnH0gOH.jpg"
    },
    {
      "title": "A Man Called Otto",
      "overview": "When a lively young family moves in next door, grumpy widower Otto Anderson meets his match in a quick-witted, pregnant woman named Marisol, leading to an unlikely friendship that turns his world upside down.",
      "rating": 7.754,
      "release_date": "2022-12-28",
      "poster_url": "https://image.tmdb.org/t/p/w500/130H1gap9lFfiTF9iDrqNIkFvC9.jpg"
    },
    {
      "title": "Finding Nemo",
      "overview": "Nemo, an adventurous young clownfish, is unexpectedly taken from his Great Barrier Reef home to a dentist's office aquarium. It's up to his worrisome father Marlin and a friendly but forgetful fish Dory to bring Nemo home -- meeting vegetarian sharks, surfer dude turtles, hypnotic jellyfish, hungry seagulls, and more along the way.",
      "rating": 7.816,
      "release_date": "2003-05-30",
      "poster_url": "https://image.tmdb.org/t/p/w500/eHuGQ10FUzK1mdOY69wF5pGgEf5.jpg"
    },
    {
      "title": "Coco",
      "overview": "Despite his family’s baffling generations-old ban on music, Miguel dreams of becoming an accomplished musician like his idol, Ernesto de la Cruz. Desperate to prove his talent, Miguel finds himself in the stunning and colorful Land of the Dead following a mysterious chain of events. Along the way, he meets charming trickster Hector, and together, they set off on an extraordinary journey to unlock the real story behind Miguel's family history.",
      "rating": 8.2,
      "release_date": "2017-10-27",
      "poster_url": "https://image.tmdb.org/t/p/w500/6Ryitt95xrO8KXuqRGm1fUuNwqF.jpg"
    },
    {
      "title": "Up",
      "overview": "Carl Fredricksen spent his entire life dreaming of exploring the globe and experiencing life to its fullest. But at age 78, life seems to have passed him by, until a twist of fate (and a persistent 8-year old Wilderness Explorer named Russell) gives him a new lease on life.",
      "rating": 7.957,
      "release_date": "2009-05-28",
      "poster_url": "https://image.tmdb.org/t/p/w500/mFvoEwSfLqbcWwFsDjQebn9bzFe.jpg"
    },
    {
      "title": "Ratatouille",
      "overview": "Remy, a resident of Paris, appreciates good food and has quite a sophisticated palate. He would love to become a chef so he can create and enjoy culinary masterpieces to his heart's delight. The only problem is, Remy is a rat. When he winds up in the sewer beneath one of Paris' finest restaurants, the rodent gourmet finds himself ideally placed to realize his dream.",
      "rating": 7.827,
      "release_date": "2007-06-28",
      "poster_url": "https://image.tmdb.org/t/p/w500/t3vaWRPSf6WjDSamIkKDs1iQWna.jpg"
    },
    {
      "title": "Sing Street",
      "overview": "A boy growing up in Dublin during the 1980s escapes his strained family life by starting a band to impress the mysterious girl he likes.",
      "rating": 7.867,
      "release_date": "2016-03-11",
      "poster_url": "https://image.tmdb.org/t/p/w500/sUWpVlrvzU2SJbnVZqIeKulPKwk.jpg"
    },
    {
      "title": "Inside Out",
      "overview": "When 11-year-old Riley moves to a new city, her Emotions team up to help her through the transition. Joy, Fear, Anger, Disgust and Sadness work together, but when Joy and Sadness get lost, they must journey through unfamiliar places to get back home.",
      "rating": 7.911,
      "release_date": "2015-06-17",
      "poster_url": "https://image.tmdb.org/t/p/w500/2H1TmgdfNtsKlU9jKdeNyYL5y8T.jpg"
    },
    {
      "title": "The Pursuit of Happyness",
      "overview": "A struggling salesman takes custody of his son as he's poised to begin a life-changing professional career.",
      "rating": 7.9,
      "release_date": "2006-12-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/lBYOKAMcxIvuk9s9hMuecB9dPBV.jpg"
    },
    {
      "title": "Yes Man",
      "overview": "Carl Allen, a guy whose life is going nowhere, signs up for a self-help program based on one simple covenant: say yes to everything…and anything.",
      "rating": 6.678,
      "release_date": "2008-12-09",
      "poster_url": "https://image.tmdb.org/t/p/w500/16zVbgFLTUaUTG1wQHuGjfWNuDM.jpg"
    },
    {
      "title": "The Way Way Back",
      "overview": "Shy 14-year-old Duncan goes on summer vacation with his mother, her overbearing boyfriend, and her boyfriend's daughter. Having a rough time fitting in, Duncan finds an unexpected friend in Owen, manager of the Water Wizz water park.",
      "rating": 7.1,
      "release_date": "2013-06-06",
      "poster_url": "https://image.tmdb.org/t/p/w500/4DgA0EDDVv37C8xISc3Vv0rhxlL.jpg"
    },
    {
      "title": "St. Vincent",
      "overview": "A young boy whose parents just divorced finds an unlikely friend and mentor in the misanthropic, bawdy, hedonistic, war veteran who lives next door.",
      "rating": 7.112,
      "release_date": "2014-10-09",
      "poster_url": "https://image.tmdb.org/t/p/w500/1bb7MTHCIPhpKZFysDpxNaNrdMk.jpg"
    },
    {
      "title": "To Begin Again",
      "overview": "A Nobel prize winner returns to his natal city looking for his home.",
      "rating": 6.4,
      "release_date": "1982-03-01",
      "poster_url": "https://image.tmdb.org/t/p/w500/v1KY4B6lEyos8Zh28hmr2NKNPMp.jpg"
    },
    {
      "title": "We Bought a Zoo",
      "overview": "Benjamin has lost his wife and, in a bid to start his life over, purchases a large house that has a zoo – welcome news for his daughter, but his son is not happy about it. The zoo is in need of renovation and Benjamin sets about the work with the head keeper and the rest of the staff, but, the zoo soon runs into financial trouble.",
      "rating": 6.805,
      "release_date": "2011-12-08",
      "poster_url": "https://image.tmdb.org/t/p/w500/dcOvIqdsojUdAtWt1nPT9xS76Su.jpg"
    },
    {
      "title": "Hector and the Search for Happiness",
      "overview": "Hector is a quirky psychiatrist who has become increasingly tired of his humdrum life. As he tells his girlfriend, Clara, he feels like a fraud: he hasn’t really tasted life, and yet he’s offering advice to patients who are just not getting any happier. So Hector decides to break out of his deluded and routine driven life. Armed with buckets of courage and child-like curiosity, he embarks on a global quest in hopes of uncovering the elusive secret formula for true happiness. And so begins a larger than life adventure with riotously funny results.",
      "rating": 6.712,
      "release_date": "2014-08-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/lymRg46xAt6s9ApWa9MBcgnzXAS.jpg"
    },
    {
      "title": "Luca",
      "overview": "Luca and his best friend Alberto experience an unforgettable summer on the Italian Riviera. But all the fun is threatened by a deeply-held secret: they are sea monsters from another world just below the water’s surface.",
      "rating": 7.806,
      "release_date": "2021-06-17",
      "poster_url": "https://image.tmdb.org/t/p/w500/9x4i9uKGXt8IiiIF5Ey0DIoY738.jpg"
    },
    {
      "title": "The Fundamentals of Caring",
      "overview": "Having suffered a tragedy, Ben becomes a caregiver to earn money. His first client, Trevor, is a hilarious 18-year-old with muscular dystrophy. One paralyzed emotionally, one paralyzed physically, Ben and Trevor hit the road on a trip into the western states. The folks they collect along the way will help them test their skills for surviving outside their calculated existence. Together, they come to understand the importance of hope and the necessity of true friendship.",
      "rating": 7.295,
      "release_date": "2016-06-16",
      "poster_url": "https://image.tmdb.org/t/p/w500/zZ0eda1GyHILNSoq9KF5u0hcq6O.jpg"
    }
  ],
  "Chill": [
    {
      "title": "The Secret Life of Walter Mitty",
      "overview": "A timid magazine photo manager who lives life vicariously through daydreams embarks on a true-life adventure when a negative goes missing.",
      "rating": 7.197,
      "release_date": "2013-12-18",
      "poster_url": "https://image.tmdb.org/t/p/w500/tY6ypjKOOtujhxiSwTmvA4OZ5IE.jpg"
    },
    {
      "title": "Into the Wild",
      "overview": "After graduating from Emory University in 1992, top student and athlete Christopher McCandless abandons his possessions, gives his entire $24,000 savings account to charity, and hitchhikes to Alaska to live in the wilderness.",
      "rating": 7.797,
      "release_date": "2007-09-21",
      "poster_url": "https://image.tmdb.org/t/p/w500/jnLnLYP5pGDfri04gxtAqAvkHMw.jpg"
    },
    {
      "title": "A Chinese Ghost Story II",
      "overview": "In this installment of a phenomenal saga of the super natural, four young people are caught in a tug-o-war of evil between an Imperial Wizard and a corrupt General. Outrageous special effects galore.",
      "rating": 6.714,
      "release_date": "1990-07-13",
      "poster_url": "https://image.tmdb.org/t/p/w500/uh9xhW3OX77fisjYNhhy4hrUtRZ.jpg"
    },
    {
      "title": "The Way Way Back",
      "overview": "Shy 14-year-old Duncan goes on summer vacation with his mother, her overbearing boyfriend, and her boyfriend's daughter. Having a rough time fitting in, Duncan finds an unexpected friend in Owen, manager of the Water Wizz water park.",
      "rating": 7.1,
      "release_date": "2013-06-06",
      "poster_url": "https://image.tmdb.org/t/p/w500/4DgA0EDDVv37C8xISc3Vv0rhxlL.jpg"
    },
    {
      "title": "Her",
      "overview": "In the not so distant future, Theodore, a lonely writer, purchases a newly developed operating system designed to meet the user's every need. To Theodore's surprise, a romantic relationship develops between him and his operating system. This unconventional love story blends science fiction and romance in a sweet tale that explores the nature of love and the ways that technology isolates and connects us all.",
      "rating": 7.85,
      "release_date": "2013-12-18",
      "poster_url": "https://image.tmdb.org/t/p/w500/lEIaL12hSkqqe83kgADkbUqEnvk.jpg"
    },
    {
      "title": "Lost in Translation",
      "overview": "Two lost souls visiting Tokyo -- the young, neglected wife of a photographer and a washed-up movie star shooting a TV commercial -- find an odd solace and pensive freedom to be real in each other's company, away from their lives in America.",
      "rating": 7.385,
      "release_date": "2003-09-18",
      "poster_url": "https://image.tmdb.org/t/p/w500/4k4Yz08WGfbu8ITIjaG99XTeco8.jpg"
    },
    {
      "title": "Garden State",
      "overview": "Andrew returns to his hometown for the funeral of his mother, a journey that reconnects him with past friends. The trip coincides with his decision to stop taking his powerful antidepressants. A chance meeting with Sam - a girl also suffering from various maladies - opens up the possibility of rekindling emotional attachments, confronting his psychologist father, and perhaps beginning a new life.",
      "rating": 7.08,
      "release_date": "2004-07-28",
      "poster_url": "https://image.tmdb.org/t/p/w500/h3iqYiGS6F3y7GxaS4AT8nFxZ2i.jpg"
    },
    {
      "title": "Midnight in Paris",
      "overview": "While on a trip to Paris with his fiancée's family, a nostalgic screenwriter finds himself mysteriously going back to the 1920s every day at midnight.",
      "rating": 7.524,
      "release_date": "2011-05-11",
      "poster_url": "https://image.tmdb.org/t/p/w500/4wBG5kbfagTQclETblPRRGihk0I.jpg"
    },
    {
      "title": "The Art of Racing in the Rain",
      "overview": "A family dog – with a near-human soul and a philosopher's mind – evaluates his life through the lessons learned by his human owner, a race-car driver.",
      "rating": 8.201,
      "release_date": "2019-08-08",
      "poster_url": "https://image.tmdb.org/t/p/w500/mi5VN4ww0JZgRFJIaPxxTGKjUg7.jpg"
    },
    {
      "title": "About Time",
      "overview": "The night after another unsatisfactory New Year's party, Tim's father tells his son that the men in his family have always had the ability to travel through time. They can't change history, but they can change what happens and has happened in their own lives. Thus begins the start of a lesson in learning to appreciate life itself as it is, as it comes, and most importantly, the people living alongside us.",
      "rating": 7.916,
      "release_date": "2013-09-04",
      "poster_url": "https://image.tmdb.org/t/p/w500/iR1bVfURbN7r1C46WHFbwCkVve.jpg"
    },
    {
      "title": "The Perks of Being a Wallflower",
      "overview": "Pittsburgh, Pennsylvania, 1991. High school freshman Charlie is a wallflower, always watching life from the sidelines, until two senior students, Sam and her stepbrother Patrick, become his mentors, helping him discover the joys of friendship, music and love.",
      "rating": 7.796,
      "release_date": "2012-09-20",
      "poster_url": "https://image.tmdb.org/t/p/w500/aKCvdFFF5n80P2VdS7d8YBwbCjh.jpg"
    },
    {
      "title": "The Station Agent",
      "overview": "When his only friend dies, a man born with dwarfism moves to rural New Jersey to live a life of solitude, only to meet a chatty hot dog vendor and a woman dealing with her own personal loss.",
      "rating": 7.354,
      "release_date": "2003-12-05",
      "poster_url": "https://image.tmdb.org/t/p/w500/kjJg6eJa9I9flfHaJG67ecEv8YX.jpg"
    },
    {
      "title": "Boyhood",
      "overview": "The film tells a story of a divorced couple trying to raise their young son. The story follows the boy for twelve years, from first grade at age 6 through 12th grade at age 17-18, and examines his relationship with his parents as he grows.",
      "rating": 7.496,
      "release_date": "2014-06-05",
      "poster_url": "https://image.tmdb.org/t/p/w500/2BvtvDUyxiMJ4dmKfiQf4qdOHQN.jpg"
    },
    {
      "title": "The Fundamentals of Caring",
      "overview": "Having suffered a tragedy, Ben becomes a caregiver to earn money. His first client, Trevor, is a hilarious 18-year-old with muscular dystrophy. One paralyzed emotionally, one paralyzed physically, Ben and Trevor hit the road on a trip into the western states. The folks they collect along the way will help them test their skills for surviving outside their calculated existence. Together, they come to understand the importance of hope and the necessity of true friendship.",
      "rating": 7.295,
      "release_date": "2016-06-16",
      "poster_url": "https://image.tmdb.org/t/p/w500/zZ0eda1GyHILNSoq9KF5u0hcq6O.jpg"
    },
    {
      "title": "Juno",
      "overview": "Faced with an unplanned pregnancy, sixteen year old high-schooler, Juno MacGuff, makes an unusual decision regarding her unborn child.",
      "rating": 7.052,
      "release_date": "2007-12-05",
      "poster_url": "https://image.tmdb.org/t/p/w500/jNIn2tVhpvFD6P9IojldI3mNYcn.jpg"
    },
    {
      "title": "The Pursuit of Happyness",
      "overview": "A struggling salesman takes custody of his son as he's poised to begin a life-changing professional career.",
      "rating": 7.9,
      "release_date": "2006-12-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/lBYOKAMcxIvuk9s9hMuecB9dPBV.jpg"
    },
    {
      "title": "Little Miss Sunshine",
      "overview": "A family loaded with quirky, colorful characters piles into an old van and road trips to California for little Olive to compete in a beauty pageant.",
      "rating": 7.693,
      "release_date": "2006-07-26",
      "poster_url": "https://image.tmdb.org/t/p/w500/wKn7AJw730emlmzLSmJtzquwaeW.jpg"
    },
    {
      "title": "The Grand Budapest Hotel",
      "overview": "The Grand Budapest Hotel tells of a legendary concierge at a famous European hotel between the wars and his friendship with a young employee who becomes his trusted protégé. The story involves the theft and recovery of a priceless Renaissance painting, the battle for an enormous family fortune and the slow and then sudden upheavals that transformed Europe during the first half of the 20th century.",
      "rating": 8.042,
      "release_date": "2014-02-26",
      "poster_url": "https://image.tmdb.org/t/p/w500/eWdyYQreja6JGCzqHWXpWHDrrPo.jpg"
    },
    {
      "title": "Chef",
      "overview": "When Chef Carl Casper suddenly quits his job at a prominent Los Angeles restaurant after refusing to compromise his creative integrity for its controlling owner, he is left to figure out what's next. Finding himself in Miami, he teams up with his ex-wife, his friend and his son to launch a food truck. Taking to the road, Chef Carl goes back to his roots to reignite his passion for the kitchen -- and zest for life and love.",
      "rating": 7.112,
      "release_date": "2014-05-08",
      "poster_url": "https://image.tmdb.org/t/p/w500/hyp8EXDmO4dSC8V6Q5jU7gD1kcg.jpg"
    },
    {
      "title": "Love, Simon",
      "overview": "Everyone deserves a great love story, but for 17-year-old Simon Spier, it's a little more complicated. He hasn't told his family or friends that he's gay, and he doesn't know the identity of the anonymous classmate that he's fallen for online.",
      "rating": 7.996,
      "release_date": "2018-02-16",
      "poster_url": "https://image.tmdb.org/t/p/w500/snIsqVPmlu4LPjvToHpDotxa7Eh.jpg"
    },
    {
      "title": "The Hundred-Foot Journey",
      "overview": "A story centered around an Indian family who moves to France and opens a restaurant across the street from a Michelin-starred French restaurant.",
      "rating": 7.292,
      "release_date": "2014-08-06",
      "poster_url": "https://image.tmdb.org/t/p/w500/1vFhSr7INoulu18smHqicft05i8.jpg"
    },
    {
      "title": "(500) Days of Summer",
      "overview": "Tom, greeting-card writer and hopeless romantic, is caught completely off-guard when his girlfriend, Summer, suddenly dumps him. He reflects on their 500 days together to try to figure out where their love affair went sour, and in doing so, Tom rediscovers his true passions in life.",
      "rating": 7.3,
      "release_date": "2009-07-17",
      "poster_url": "https://image.tmdb.org/t/p/w500/qXAuQ9hF30sQRsXf40OfRVl0MJZ.jpg"
    },
    {
      "title": "The Fault in Our Stars",
      "overview": "Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a patient named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel's story is about to be completely rewritten.",
      "rating": 7.599,
      "release_date": "2014-05-16",
      "poster_url": "https://image.tmdb.org/t/p/w500/ep7dF4QR4Mm39LI958V0XbwE0hK.jpg"
    },
    {
      "title": "Tangled",
      "overview": "Feisty teenager Rapunzel, who has long and magical hair, wants to go and see sky lanterns on her eighteenth birthday, but she's bound to a tower by her overprotective mother. She strikes a deal with Flynn Rider, a charming wanted thief, and the duo set off on an action-packed escapade.",
      "rating": 7.607,
      "release_date": "2010-11-24",
      "poster_url": "https://image.tmdb.org/t/p/w500/ym7Kst6a4uodryxqbGOxmewF235.jpg"
    },
    {
      "title": "The Giver",
      "overview": "In a seemingly perfect community, without war, pain, suffering, differences or choice, a young boy is chosen to learn from an elderly man about the true pain and pleasure of the \"real\" world.",
      "rating": 6.554,
      "release_date": "2014-08-13",
      "poster_url": "https://image.tmdb.org/t/p/w500/dul62Av4pgi5x8LP7ELHzNyka9Z.jpg"
    },
    {
      "title": "The Secret Garden",
      "overview": "A young British girl born and reared in India loses her neglectful parents in an earthquake. She is returned to England to live at her uncle's castle. Her uncle is very distant due to the loss of his wife ten years before. Neglected once again, she begins exploring the estate and discovers a garden that has been locked and forgotten. Aided by one of the servants' boys, she begins restoring the garden, and eventually discovers some other secrets of the manor.",
      "rating": 7.42,
      "release_date": "1993-08-13",
      "poster_url": "https://image.tmdb.org/t/p/w500/zf6h5dJ7wVG7LqMO9dhHGHVejzj.jpg"
    },
    {
      "title": "Once",
      "overview": "Filmed on a California beach, this arty outing features loin-cloth wearing actors silently telling the allegorical love story between Creation and Humanity on a lonely California beach.",
      "rating": 2,
      "release_date": "1973-09-01",
      "poster_url": "https://image.tmdb.org/t/p/w500/yaGYRt588x6t6RJ0BfjOp7NxtuO.jpg"
    },
    {
      "title": "The Darjeeling Limited",
      "overview": "Three American brothers who have not spoken to each other in a year set off on a train voyage across India with a plan to find themselves and bond with each other -- to become brothers again like they used to be. Their \"spiritual quest\", however, veers rapidly off-course (due to events involving over-the-counter pain killers, Indian cough syrup, and pepper spray).",
      "rating": 7.159,
      "release_date": "2007-09-07",
      "poster_url": "https://image.tmdb.org/t/p/w500/oSW5OVXTulaIXcoNwJAp5YEKpbP.jpg"
    },
    {
      "title": "Luca",
      "overview": "Luca and his best friend Alberto experience an unforgettable summer on the Italian Riviera. But all the fun is threatened by a deeply-held secret: they are sea monsters from another world just below the water’s surface.",
      "rating": 7.806,
      "release_date": "2021-06-17",
      "poster_url": "https://image.tmdb.org/t/p/w500/9x4i9uKGXt8IiiIF5Ey0DIoY738.jpg"
    },
    {
      "title": "The Book Thief",
      "overview": "While subjected to the horrors of WWII Germany, young Liesel finds solace by stealing books and sharing them with others. Under the stairs in her home, a Jewish refugee is being sheltered by her adoptive parents.",
      "rating": 7.492,
      "release_date": "2013-11-08",
      "poster_url": "https://image.tmdb.org/t/p/w500/wj4U5sMLcJMa3WR9CpRR9e2sdgZ.jpg"
    }
  ],
  "Nostalgic": [
    {
      "title": "Back to the Future",
      "overview": "Eighties teenager Marty McFly is accidentally sent back in time to 1955, inadvertently disrupting his parents' first meeting and attracting his mother's romantic interest. Marty must repair the damage to history by rekindling his parents' romance and - with the help of his eccentric inventor friend Doc Brown - return to 1985.",
      "rating": 8.319,
      "release_date": "1985-07-03",
      "poster_url": "https://image.tmdb.org/t/p/w500/vN5B5WgYscRGcQpVhHl6p9DDTP0.jpg"
    },
    {
      "title": "The Sandlot",
      "overview": "During a summer of friendship and adventure, one boy becomes a part of the gang, nine boys become a team and their leader becomes a legend by confronting the terrifying mystery beyond the right field wall.",
      "rating": 7.533,
      "release_date": "1993-04-07",
      "poster_url": "https://image.tmdb.org/t/p/w500/7PYqz0viEuW8qTvuGinUMjDWMnj.jpg"
    },
    {
      "title": "The Breakfast Club",
      "overview": "Five high school students from different walks of life endure a Saturday detention under a power-hungry principal. The disparate group includes rebel John, princess Claire, outcast Allison, brainy Brian and Andrew, the jock. Each has a chance to tell his or her story, making the others see them a little differently -- and when the day ends, they question whether school will ever be the same.",
      "rating": 7.734,
      "release_date": "1985-02-15",
      "poster_url": "https://image.tmdb.org/t/p/w500/wM9ErA8UVdcce5P4oefQinN8VVV.jpg"
    },
    {
      "title": "The Goonies",
      "overview": "Young teenager Mikey Walsh finds an old treasure map in his father's attic. Hoping to save their homes from demolition, Mikey and his friends Data, Chunk, and Mouth set off on a quest to find the secret stash of Pirate One-Eyed Willie.",
      "rating": 7.513,
      "release_date": "1985-06-07",
      "poster_url": "https://image.tmdb.org/t/p/w500/eBU7gCjTCj9n2LTxvCSIXXOvHkD.jpg"
    },
    {
      "title": "Ferris Bueller's Day Off",
      "overview": "After high school slacker Ferris Bueller successfully fakes an illness in order to skip school for the day, he goes on a series of adventures throughout Chicago with his girlfriend Sloane and best friend Cameron, all the while trying to outwit his wily school principal and fed-up sister.",
      "rating": 7.576,
      "release_date": "1986-06-11",
      "poster_url": "https://image.tmdb.org/t/p/w500/9LTQNCvoLsKXP0LtaKAaYVtRaQL.jpg"
    },
    {
      "title": "E.T. the Extra-Terrestrial",
      "overview": "An alien is left behind on Earth and saved by the 10-year-old Elliot who decides to keep him hidden in his home. While a task force hunts for the extra-terrestrial, Elliot, his brother, and his little sister Gertie form an emotional bond with their new friend, and try to help him find his way home.",
      "rating": 7.513,
      "release_date": "1982-06-11",
      "poster_url": "https://image.tmdb.org/t/p/w500/an0nD6uq6byfxXCfk6lQBzdL2J1.jpg"
    },
    {
      "title": "Stand by Me Doraemon 2",
      "overview": "Nobita travels to the future to show his beloved grandma his bride, but adult Nobita has fled his own wedding.",
      "rating": 7.849,
      "release_date": "2020-11-20",
      "poster_url": "https://image.tmdb.org/t/p/w500/vBv8iOFPLnXmtELUjcFc7OKHsR4.jpg"
    },
    {
      "title": "The Princess Bride",
      "overview": "In this enchantingly cracked fairy tale, the beautiful Princess Buttercup and the dashing Westley must overcome staggering odds to find happiness amid six-fingered swordsmen, murderous princes, Sicilians and rodents of unusual size. But even death can't stop these true lovebirds from triumphing.",
      "rating": 7.7,
      "release_date": "1987-09-25",
      "poster_url": "https://image.tmdb.org/t/p/w500/kTXxdNv44najTayFcrT487xWuDv.jpg"
    },
    {
      "title": "The Wizard of Oz",
      "overview": "Young Dorothy finds herself in a magical world where she makes friends with a lion, a scarecrow and a tin man as they make their way along the yellow brick road to talk with the Wizard and ask for the things they miss most in their lives. The Wicked Witch of the West is the only thing that could stop them.",
      "rating": 7.59,
      "release_date": "1939-08-15",
      "poster_url": "https://image.tmdb.org/t/p/w500/pfAZFD7I2hxW9HCChTuAzsdE6UX.jpg"
    },
    {
      "title": "Labyrinth",
      "overview": "Sofia a 18 year-old girl finds herself in a situation that leaves her dazed and  confused. She has taken something, and ended up in what seems like planet Earth,  but apparently is not. On her journey she is met with a majestical being, an angel  that is set to help them through the memories of her past. Although, she soon finds  out the truth of this world, and where she is heading to. Sofia is on her own to find  her way out, and remember the painful memories of her impulsive choices.",
      "rating": 0,
      "release_date": "2024-05-16",
      "poster_url": "https://image.tmdb.org/t/p/w500/bAMEKYoKIgvGlmHb0Luqux6Nn6s.jpg"
    },
    {
      "title": "The NeverEnding Story",
      "overview": "While hiding from bullies in his school's attic, a young boy discovers the extraordinary land of Fantasia, through a magical book called The Neverending Story. The book tells the tale of Atreyu, a young warrior who, with the help of a luck dragon named Falkor, must save Fantasia from the destruction of The Nothing.",
      "rating": 7.198,
      "release_date": "1984-04-06",
      "poster_url": "https://image.tmdb.org/t/p/w500/ddYCa91iDXfJCxaqSYzwi2fjfnl.jpg"
    },
    {
      "title": "Ghostbusters",
      "overview": "After losing their academic posts at a prestigious university, a team of parapsychologists goes into business as proton-pack-toting \"ghostbusters\" who exterminate ghouls, hobgoblins and supernatural pests of all stripes. An ad campaign pays off when a knockout cellist hires the squad to purge her swanky digs of demons that appear to be living in her refrigerator.",
      "rating": 7.493,
      "release_date": "1984-06-08",
      "poster_url": "https://image.tmdb.org/t/p/w500/7E8nLijS9AwwUEPu2oFYOVKhdFA.jpg"
    },
    {
      "title": "Jumanji",
      "overview": "When siblings Judy and Peter discover an enchanted board game that opens the door to a magical world, they unwittingly invite Alan -- an adult who's been trapped inside the game for 26 years -- into their living room. Alan's only hope for freedom is to finish the game, which proves risky as all three find themselves running from giant rhinoceroses, evil monkeys and other terrifying creatures.",
      "rating": 7.236,
      "release_date": "1995-12-15",
      "poster_url": "https://image.tmdb.org/t/p/w500/vgpXmVaVyUL7GGiDeiK1mKEKzcX.jpg"
    },
    {
      "title": "The Karate Kid",
      "overview": "Twelve-year-old Dre Parker could have been the most popular kid in Detroit, but his mother's latest career move has landed him in China. Dre immediately falls for his classmate Mei Ying but the cultural differences make such a friendship impossible. Even worse, Dre's feelings make him an enemy of the class bully, Cheng. With no friends in a strange land, Dre has nowhere to turn but maintenance man Mr. Han, who is a kung fu master. As Han teaches Dre that kung fu is not about punches and parries, but maturity and calm, Dre realizes that facing down the bullies will be the fight of his life.",
      "rating": 6.55,
      "release_date": "2010-06-10",
      "poster_url": "https://image.tmdb.org/t/p/w500/qV8xTWfknTOSErSa0b9Iay2QztS.jpg"
    },
    {
      "title": "The Lion King",
      "overview": "Young lion prince Simba, eager to one day become king of the Pride Lands, grows up under the watchful eye of his father Mufasa; all the while his villainous uncle Scar conspires to take the throne for himself. Amid betrayal and tragedy, Simba must confront his past and find his rightful place in the Circle of Life.",
      "rating": 8.3,
      "release_date": "1994-06-15",
      "poster_url": "https://image.tmdb.org/t/p/w500/sKCr78MXSLixwmZ8DyJLrpMsd15.jpg"
    },
    {
      "title": "D3: The Mighty Ducks",
      "overview": "The Ducks are offered scholarships at Eden Hall Academy but struggle with their new coach's methods and come under pressure from the board to retain their scholarships before their big game against the Varsity team.",
      "rating": 5.953,
      "release_date": "1996-10-04",
      "poster_url": "https://image.tmdb.org/t/p/w500/wltMr1loUKSCaEV4EDgh21eCRI3.jpg"
    },
    {
      "title": "The Parent Trap (1998)"
    },
    {
      "title": "Dirty Dancing",
      "overview": "Spending the summer at a Catskills resort with her family, Frances \"Baby\" Houseman falls in love with the camp's dance instructor, Johnny Castle, and nothing is ever the same for anyone in the Houseman family.",
      "rating": 5.5,
      "release_date": "2017-05-24",
      "poster_url": "https://image.tmdb.org/t/p/w500/ySL7B4FgYZR5xFBWc7c7lssuCN9.jpg"
    },
    {
      "title": "The Outsiders",
      "overview": "When two poor Greasers, Johnny and Ponyboy, are assaulted by a vicious gang, the Socs, and Johnny kills one of the attackers, tension begins to mount between the two rival gangs, setting off a turbulent chain of events.",
      "rating": 7.2,
      "release_date": "1983-03-25",
      "poster_url": "https://image.tmdb.org/t/p/w500/pl8Tf36TAOb2i561yPbQ9xl4P4D.jpg"
    },
    {
      "title": "Big",
      "overview": "When a young boy makes a wish at a carnival machine to be big—he wakes up the following morning to find that it has been granted and his body has grown older overnight. But he is still the same 13-year-old boy inside. Now he must learn how to cope with the unfamiliar world of grown-ups including getting a job and having his first romantic encounter with a woman.",
      "rating": 7.181,
      "release_date": "1988-06-03",
      "poster_url": "https://image.tmdb.org/t/p/w500/eWhCDJiwxvx3YXkAFRiHjimnF0j.jpg"
    },
    {
      "title": "Beetlejuice",
      "overview": "A newly dead New England couple seeks help from a deranged demon exorcist to scare an affluent New York family out of their home.",
      "rating": 7.375,
      "release_date": "1988-03-30",
      "poster_url": "https://image.tmdb.org/t/p/w500/nnl6OWkyPpuMm595hmAxNW3rZFn.jpg"
    },
    {
      "title": "Aladdin",
      "overview": "In the boorish city of Agrabah, kind-hearted street urchin Aladdin and Princess Jasmine fall in love, although she can only marry a prince. He and power-hungry Grand Vizier Jafar vie for a magic lamp that can fulfill their wishes.",
      "rating": 7.652,
      "release_date": "1992-11-25",
      "poster_url": "https://image.tmdb.org/t/p/w500/eLFfl7vS8dkeG1hKp5mwbm37V83.jpg"
    },
    {
      "title": "The Little Mermaid",
      "overview": "A young reporter and his niece discover a beautiful and enchanting creature they believe to be the real little mermaid.",
      "rating": 5.027,
      "release_date": "2018-08-02",
      "poster_url": "https://image.tmdb.org/t/p/w500/qEM80vqREgfjk7YhIbl4AgfZ47S.jpg"
    },
    {
      "title": "Toy Story",
      "overview": "Led by Woody, Andy's toys live happily in his room until Andy's birthday brings Buzz Lightyear onto the scene. Afraid of losing his place in Andy's heart, Woody plots against Buzz. But when circumstances separate Buzz and Woody from their owner, the duo eventually learns to put aside their differences.",
      "rating": 8,
      "release_date": "1995-11-22",
      "poster_url": "https://image.tmdb.org/t/p/w500/uXDfjJbdP4ijW5hWSBrPrlKpxab.jpg"
    },
    {
      "title": "Annie",
      "overview": "An orphan in a facility run by the mean Miss Hannigan, Annie believes that her parents left her there by mistake. When a rich man named Oliver \"Daddy\" Warbucks decides to let an orphan live at his home to promote his image, Annie is selected. While Annie gets accustomed to living in Warbucks' mansion, she still longs to meet her parents. So Warbucks announces a search for them and a reward, which brings out many frauds.",
      "rating": 6.528,
      "release_date": "1982-05-21",
      "poster_url": "https://image.tmdb.org/t/p/w500/6dG7UTAISJGh6FqTKIwN7sR11w2.jpg"
    },
    {
      "title": "Mary Poppins",
      "overview": "Mr Banks is looking for a nanny for his two mischievous children and comes across Mary Poppins, an angelic nanny. She not only brings a change in their lives but also spreads happiness.",
      "rating": 7.563,
      "release_date": "1964-12-17",
      "poster_url": "https://image.tmdb.org/t/p/w500/ei8hhYCMfURfPOXKBnyl61be2iV.jpg"
    },
    {
      "title": "Tom and Jerry: Willy Wonka and the Chocolate Factory",
      "overview": "The classic Roald Dahl tale gets a modern twist when Tom and Jerry enter the amazing world of Willy Wonka's Chocolate Factory.",
      "rating": 6.7,
      "release_date": "2017-06-28",
      "poster_url": "https://image.tmdb.org/t/p/w500/vh5iYhj80l1inSdep61sF8g1S8m.jpg"
    },
    {
      "title": "The Jungle Book (1967)"
    },
    {
      "title": "Cool Runnings",
      "overview": "When a Jamaican sprinter is disqualified from the Olympic Games, he enlists the help of a dishonored coach to start the first Jamaican bobsled team.",
      "rating": 6.993,
      "release_date": "1993-10-01",
      "poster_url": "https://image.tmdb.org/t/p/w500/6fXuGEb7EqGmAeUodxm7l5ELPZ.jpg"
    }
  ],
  "Adventurous": [
    {
      "title": "Raiders of the Lost Ark",
      "overview": "When Dr. Indiana Jones – the tweed-suited professor who just happens to be a celebrated archaeologist – is hired by the government to locate the legendary Ark of the Covenant, he finds himself up against the entire Nazi regime.",
      "rating": 7.922,
      "release_date": "1981-06-12",
      "poster_url": "https://image.tmdb.org/t/p/w500/ceG9VzoRAVGwivFU403Wc3AHRys.jpg"
    },
    {
      "title": "The Lord of the Rings: The Fellowship of the Ring",
      "overview": "Young hobbit Frodo Baggins, after inheriting a mysterious ring from his uncle Bilbo, must leave his home in order to keep it from falling into the hands of its evil creator. Along the way, a fellowship is formed to protect the ringbearer and make sure that the ring arrives at its final destination: Mt. Doom, the only place where it can be destroyed.",
      "rating": 8.42,
      "release_date": "2001-12-18",
      "poster_url": "https://image.tmdb.org/t/p/w500/6oom5QYQ2yQTMJIbnvbkBL9cHo6.jpg"
    },
    {
      "title": "Jurassic Park",
      "overview": "A wealthy entrepreneur secretly creates a theme park featuring living dinosaurs drawn from prehistoric DNA. Before opening day, he invites a team of experts and his two eager grandchildren to experience the park and help calm anxious investors. However, the park is anything but amusing as the security systems go off-line and the dinosaurs escape.",
      "rating": 7.953,
      "release_date": "1993-06-11",
      "poster_url": "https://image.tmdb.org/t/p/w500/fjTU1Bgh3KJu4aatZil3sofR2zC.jpg"
    },
    {
      "title": "The Revenant",
      "overview": "In the 1820s, a frontiersman, Hugh Glass, sets out on a path of vengeance against those who left him for dead after a bear mauling.",
      "rating": 7.534,
      "release_date": "2015-12-25",
      "poster_url": "https://image.tmdb.org/t/p/w500/ji3ecJphATlVgWNY0B0RVXZizdf.jpg"
    },
    {
      "title": "Pirates of the Caribbean: The Curse of the Black Pearl",
      "overview": "After Port Royal is attacked and pillaged by a mysterious pirate crew, capturing the governor's daughter Elizabeth Swann in the process, William Turner asks free-willing pirate Jack Sparrow to help him locate the crew's ship—The Black Pearl—so that he can rescue the woman he loves.",
      "rating": 7.809,
      "release_date": "2003-07-09",
      "poster_url": "https://image.tmdb.org/t/p/w500/z8onk7LV9Mmw6zKz4hT6pzzvmvl.jpg"
    },
    {
      "title": "The Hunger Games",
      "overview": "Every year in the ruins of what was once North America, the nation of Panem forces each of its twelve districts to send a teenage boy and girl to compete in the Hunger Games.  Part twisted entertainment, part government intimidation tactic, the Hunger Games are a nationally televised event in which “Tributes” must fight with one another until one survivor remains.  Pitted against highly-trained Tributes who have prepared for these Games their entire lives, Katniss is forced to rely upon her sharp instincts as well as the mentorship of drunken former victor Haymitch Abernathy.  If she’s ever to return home to District 12, Katniss must make impossible choices in the arena that weigh survival against humanity and life against love. The world will be watching.",
      "rating": 7.215,
      "release_date": "2012-03-12",
      "poster_url": "https://image.tmdb.org/t/p/w500/yXCbOiVDCxO71zI7cuwBRXdftq8.jpg"
    },
    {
      "title": "Mad Max: Fury Road",
      "overview": "An apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and most everyone is crazed fighting for the necessities of life. Within this world exist two rebels on the run who just might be able to restore order.",
      "rating": 7.622,
      "release_date": "2015-05-13",
      "poster_url": "https://image.tmdb.org/t/p/w500/hA2ple9q4qnwxp3hKVNhroipsir.jpg"
    },
    {
      "title": "The Secret Life of Walter Mitty",
      "overview": "A timid magazine photo manager who lives life vicariously through daydreams embarks on a true-life adventure when a negative goes missing.",
      "rating": 7.197,
      "release_date": "2013-12-18",
      "poster_url": "https://image.tmdb.org/t/p/w500/tY6ypjKOOtujhxiSwTmvA4OZ5IE.jpg"
    },
    {
      "title": "Jumanji: Welcome to the Jungle",
      "overview": "Four teenagers in detention discover an old video game console with a game they’ve never heard of. When they decide to play, they are immediately sucked into the jungle world of Jumanji in the bodies of their avatars. They’ll have to complete the adventure of their lives filled with fun, thrills and danger or be stuck in the game forever!",
      "rating": 6.82,
      "release_date": "2017-12-09",
      "poster_url": "https://image.tmdb.org/t/p/w500/pSgXKPU5h6U89ipF7HBYajvYt7j.jpg"
    },
    {
      "title": "The Mummy",
      "overview": "Dashing legionnaire Rick O'Connell stumbles upon the hidden ruins of Hamunaptra while in the midst of a battle to claim the area in 1920s Egypt. It has been over three thousand years since former High Priest Imhotep suffered a fate worse than death as a punishment for a forbidden love—along with a curse that guarantees eternal doom upon the world if he is ever awoken.",
      "rating": 6.941,
      "release_date": "1999-04-16",
      "poster_url": "https://image.tmdb.org/t/p/w500/yhIsVvcUm7QxzLfT6HW2wLf5ajY.jpg"
    },
    {
      "title": "King Kong",
      "overview": "In 1933 New York, an overly ambitious movie producer coerces his cast and hired ship crew to travel to mysterious Skull Island, where they encounter Kong, a giant ape who is immediately smitten with the leading lady.",
      "rating": 6.884,
      "release_date": "2005-12-12",
      "poster_url": "https://image.tmdb.org/t/p/w500/6a2HY6UmD7XiDD3NokgaBAXEsD2.jpg"
    },
    {
      "title": "Avatar",
      "overview": "In the 22nd century, a paraplegic Marine is dispatched to the moon Pandora on a unique mission, but becomes torn between following orders and protecting an alien civilization.",
      "rating": 7.589,
      "release_date": "2009-12-15",
      "poster_url": "https://image.tmdb.org/t/p/w500/kyeqWdyUXW608qlYkRqosgbbJyK.jpg"
    },
    {
      "title": "Guardians of the Galaxy",
      "overview": "Light years from Earth, 26 years after being abducted, Peter Quill finds himself the prime target of a manhunt after discovering an orb wanted by Ronan the Accuser.",
      "rating": 7.904,
      "release_date": "2014-07-30",
      "poster_url": "https://image.tmdb.org/t/p/w500/jPrJPZKJVhvyJ4DmUTrDgmFN0yG.jpg"
    },
    {
      "title": "The Dark Knight",
      "overview": "Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker.",
      "rating": 8.52,
      "release_date": "2008-07-16",
      "poster_url": "https://image.tmdb.org/t/p/w500/qJ2tW6WMUDux911r6m7haRef0WH.jpg"
    },
    {
      "title": "The Giver",
      "overview": "In a seemingly perfect community, without war, pain, suffering, differences or choice, a young boy is chosen to learn from an elderly man about the true pain and pleasure of the \"real\" world.",
      "rating": 6.554,
      "release_date": "2014-08-13",
      "poster_url": "https://image.tmdb.org/t/p/w500/dul62Av4pgi5x8LP7ELHzNyka9Z.jpg"
    },
    {
      "title": "Inception",
      "overview": "Cobb, a skilled thief who commits corporate espionage by infiltrating the subconscious of his targets is offered a chance to regain his old life as payment for a task considered to be impossible: \"inception\", the implantation of another person's idea into a target's subconscious.",
      "rating": 8.368,
      "release_date": "2010-07-15",
      "poster_url": "https://image.tmdb.org/t/p/w500/ljsZTbVsrQSqZgWeep2B1QiDKuh.jpg"
    },
    {
      "title": "Interstellar",
      "overview": "The adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.",
      "rating": 8.455,
      "release_date": "2014-11-05",
      "poster_url": "https://image.tmdb.org/t/p/w500/gEU2QniE6E77NI6lCU6MxlNBvIx.jpg"
    },
    {
      "title": "The Martian",
      "overview": "During a manned mission to Mars, Astronaut Mark Watney is presumed dead after a fierce storm and left behind by his crew. But Watney has survived and finds himself stranded and alone on the hostile planet. With only meager supplies, he must draw upon his ingenuity, wit and spirit to subsist and find a way to signal to Earth that he is alive.",
      "rating": 7.688,
      "release_date": "2015-09-30",
      "poster_url": "https://image.tmdb.org/t/p/w500/3ndAx3weG6KDkJIRMCi5vXX6Dyb.jpg"
    },
    {
      "title": "Star Wars",
      "overview": "Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker and dashing captain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.",
      "rating": 8.204,
      "release_date": "1977-05-25",
      "poster_url": "https://image.tmdb.org/t/p/w500/6FfCtAuVAW8XJjZ7eWeLibRLWTw.jpg"
    },
    {
      "title": "The Adventures of Tintin",
      "overview": "Intrepid young reporter, Tintin, and his loyal dog, Snowy, are thrust into a world of high adventure when they discover a ship carrying an explosive secret. As Tintin is drawn into a centuries-old mystery, Ivan Ivanovitch Sakharine suspects him of stealing a priceless treasure. Tintin and Snowy, with the help of salty, cantankerous Captain Haddock and bumbling detectives, Thompson and Thomson, travel half the world, one step ahead of their enemies, as Tintin endeavors to find the Unicorn, a sunken ship that may hold a vast fortune, but also an ancient curse.",
      "rating": 6.901,
      "release_date": "2011-10-24",
      "poster_url": "https://image.tmdb.org/t/p/w500/fQZ3sLR1Fi63NMsNRbjm9q5qODJ.jpg"
    },
    {
      "title": "The Chronicles of Narnia: The Lion, the Witch and the Wardrobe",
      "overview": "Siblings Lucy, Edmund, Susan and Peter step through a magical wardrobe and find the land of Narnia. There, they discover a charming, once peaceful kingdom that has been plunged into eternal winter by the evil White Witch, Jadis. Aided by the wise and magnificent lion, Aslan, the children lead Narnia into a spectacular, climactic battle to be free of the Witch's glacial powers forever.",
      "rating": 7.133,
      "release_date": "2005-12-07",
      "poster_url": "https://image.tmdb.org/t/p/w500/iREd0rNCjYdf5Ar0vfaW32yrkm.jpg"
    },
    {
      "title": "Bogotá: City of the Lost",
      "overview": "After moving to Bogotá for a chance at a better life, a young Korean man rises through the Colombian black market — risking peril for a shot at success.",
      "rating": 6.994,
      "release_date": "2024-12-31",
      "poster_url": "https://image.tmdb.org/t/p/w500/p1WPGGPVHHVJwTjmUaCsbTNATgn.jpg"
    },
    {
      "title": "Tomb Raider",
      "overview": "Lara Croft, the fiercely independent daughter of a missing adventurer, must push herself beyond her limits when she finds herself on the island where her father disappeared.",
      "rating": 6.367,
      "release_date": "2018-03-05",
      "poster_url": "https://image.tmdb.org/t/p/w500/s4Qn5LF6OwK4rIifmthIDtbqDSs.jpg"
    },
    {
      "title": "Skyfall",
      "overview": "When Bond's latest assignment goes gravely wrong, agents around the world are exposed and MI6 headquarters is attacked. While M faces challenges to her authority and position from Gareth Mallory, the new Chairman of the Intelligence and Security Committee, it's up to Bond, aided only by field agent Eve, to locate the mastermind behind the attack.",
      "rating": 7.249,
      "release_date": "2012-10-24",
      "poster_url": "https://image.tmdb.org/t/p/w500/d0IVecFQvsGdSbnMAHqiYsNYaJT.jpg"
    },
    {
      "title": "The Princess Bride",
      "overview": "In this enchantingly cracked fairy tale, the beautiful Princess Buttercup and the dashing Westley must overcome staggering odds to find happiness amid six-fingered swordsmen, murderous princes, Sicilians and rodents of unusual size. But even death can't stop these true lovebirds from triumphing.",
      "rating": 7.7,
      "release_date": "1987-09-25",
      "poster_url": "https://image.tmdb.org/t/p/w500/kTXxdNv44najTayFcrT487xWuDv.jpg"
    },
    {
      "title": "The Maze Runner",
      "overview": "Set in a post-apocalyptic world, young Thomas is deposited in a community of boys after his memory is erased, soon learning they're all trapped in a maze that will require him to join forces with fellow “runners” for a shot at escape.",
      "rating": 7.19,
      "release_date": "2014-09-10",
      "poster_url": "https://image.tmdb.org/t/p/w500/ode14q7WtDugFDp78fo9lCsmay9.jpg"
    },
    {
      "title": "Brave",
      "overview": "Brave is set in the mystical Scottish Highlands, where Mérida is the princess of a kingdom ruled by King Fergus and Queen Elinor. An unruly daughter and an accomplished archer, Mérida one day defies a sacred custom of the land and inadvertently brings turmoil to the kingdom. In an attempt to set things right, Mérida seeks out an eccentric old Wise Woman and is granted an ill-fated wish. Also figuring into Mérida’s quest — and serving as comic relief — are the kingdom’s three lords: the enormous Lord MacGuffin, the surly Lord Macintosh, and the disagreeable Lord Dingwall.",
      "rating": 7.02,
      "release_date": "2012-06-21",
      "poster_url": "https://image.tmdb.org/t/p/w500/1XAuDtMWpL0sYSFK0R6EZate2Ux.jpg"
    },
    {
      "title": "The Hobbit: An Unexpected Journey",
      "overview": "Bilbo Baggins, a hobbit enjoying his quiet life, is swept into an epic quest by Gandalf the Grey and thirteen dwarves who seek to reclaim their mountain home from Smaug, the dragon.",
      "rating": 7.358,
      "release_date": "2012-12-12",
      "poster_url": "https://image.tmdb.org/t/p/w500/yHA9Fc37VmpUA5UncTxxo3rTGVA.jpg"
    },
    {
      "title": "Sherlock Holmes",
      "overview": "Eccentric consulting detective Sherlock Holmes and Doctor John Watson battle to bring down a new nemesis and unravel a deadly plot that could destroy England.",
      "rating": 7.214,
      "release_date": "2009-12-23",
      "poster_url": "https://image.tmdb.org/t/p/w500/fvnu6QHyR0gSV1JI6lMyXCny21a.jpg"
    }
  ],
  "Motivational": [
    {
      "title": "The Pursuit of Happyness",
      "overview": "A struggling salesman takes custody of his son as he's poised to begin a life-changing professional career.",
      "rating": 7.9,
      "release_date": "2006-12-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/lBYOKAMcxIvuk9s9hMuecB9dPBV.jpg"
    },
    {
      "title": "Rocky",
      "overview": "An uneducated collector for a Philadelphia loan shark is given a once-in-a-lifetime opportunity to fight against the world heavyweight boxing champion.",
      "rating": 7.787,
      "release_date": "1976-11-20",
      "poster_url": "https://image.tmdb.org/t/p/w500/8kEun6U9hTddM7NEfLLCGQKU2Mp.jpg"
    },
    {
      "title": "Rudy",
      "overview": "Set in the heart of rural England, Rudy finds her relationship with her father being tested. Stuck as a proxy parent to her younger siblings and dealing with a recent loss, she feels increasingly pushed out when her home gets opened up to a paying guest. Through a newfound friendship with a boy from Coventry, she discovers fun, freedom and autonomy, but is it at the sacrifice of unspoken family wounds?",
      "rating": 6,
      "release_date": "2023-06-30",
      "poster_url": "https://image.tmdb.org/t/p/w500/cRWjrjhyATLou19krzNz9QLs2n6.jpg"
    },
    {
      "title": "The Social Network",
      "overview": "In 2003, Harvard undergrad and computer programmer Mark Zuckerberg begins work on a new concept that eventually turns into the global social network known as Facebook. Six years later, Mark is one of the youngest billionaires ever, but his unprecedented success leads to both personal and legal complications when he ends up on the receiving end of two lawsuits, one involving his former friend.",
      "rating": 7.37,
      "release_date": "2010-10-01",
      "poster_url": "https://image.tmdb.org/t/p/w500/n0ybibhJtQ5icDqTp8eRytcIHJx.jpg"
    },
    {
      "title": "The Theory of Everything",
      "overview": "The Theory of Everything is the extraordinary story of one of the world’s greatest living minds, the renowned astrophysicist Stephen Hawking, who falls deeply in love with fellow Cambridge student Jane Wilde.",
      "rating": 7.843,
      "release_date": "2014-11-07",
      "poster_url": "https://image.tmdb.org/t/p/w500/kJuL37NTE51zVP3eG5aGMyKAIlh.jpg"
    },
    {
      "title": "Dead Poets Society",
      "overview": "At an elite, old-fashioned boarding school in New England, a passionate English teacher inspires his students to rebel against convention and seize the potential of every day, courting the disdain of the stern headmaster.",
      "rating": 8.302,
      "release_date": "1989-06-02",
      "poster_url": "https://image.tmdb.org/t/p/w500/erzbMlcNHOdx24AXOcn2ZKA7R1q.jpg"
    },
    {
      "title": "Hidden Figures",
      "overview": "The untold story of Katherine G. Johnson, Dorothy Vaughan and Mary Jackson – brilliant African-American women working at NASA and serving as the brains behind one of the greatest operations in history – the launch of astronaut John Glenn into orbit. The visionary trio crossed all gender and race lines to inspire generations to dream big.",
      "rating": 8.055,
      "release_date": "2016-12-10",
      "poster_url": "https://image.tmdb.org/t/p/w500/9lfz2W2uGjyow3am00rsPJ8iOyq.jpg"
    },
    {
      "title": "Good Will Hunting",
      "overview": "Headstrong yet aimless, Will Hunting has a genius-level IQ but chooses to work as a janitor at MIT. When he secretly solves highly difficult graduate-level math problems, his talents are discovered by Professor Gerald Lambeau, who decides to help the misguided youth reach his potential. When Will is arrested for attacking a police officer, Professor Lambeau makes a deal to get leniency for him if he gets court-ordered therapy. Eventually, therapist Dr. Sean Maguire helps Will confront the demons that are holding him back.",
      "rating": 8.158,
      "release_date": "1997-12-05",
      "poster_url": "https://image.tmdb.org/t/p/w500/z2FnLKpFi1HPO7BEJxdkv6hpJSU.jpg"
    },
    {
      "title": "The Intern",
      "overview": "70-year-old widower Ben Whittaker has discovered that retirement isn't all it's cracked up to be. Seizing an opportunity to get back in the game, he becomes a senior intern at an online fashion site, founded and run by Jules Ostin.",
      "rating": 7.221,
      "release_date": "2015-09-23",
      "poster_url": "https://image.tmdb.org/t/p/w500/9UoAC9tu8kIyRy8AcJnGhnH0gOH.jpg"
    },
    {
      "title": "Moneyball",
      "overview": "The story of Oakland Athletics general manager Billy Beane's successful attempt to put together a baseball team on a budget, by employing computer-generated analysis to draft his players.",
      "rating": 7.28,
      "release_date": "2011-09-23",
      "poster_url": "https://image.tmdb.org/t/p/w500/4yIQq1e6iOcaZ5rLDG3lZBP3j7a.jpg"
    },
    {
      "title": "A Beautiful Mind",
      "overview": "From the heights of notoriety to the depths of depravity, John Forbes Nash Jr. experiences it all. As a brilliant but socially awkward mathematician, he made a groundbreaking discovery early in his career and stands on the brink of international acclaim. But as the handsome and arrogant Nash accepts secret work in cryptography, he becomes entangled in a mysterious conspiracy. His life takes a nightmarish turn and he soon finds himself on a painful and harrowing journey of self-discovery.",
      "rating": 7.854,
      "release_date": "2001-12-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/rEIg5yJdNOt9fmX4P8gU9LeNoTQ.jpg"
    },
    {
      "title": "Coach Carter",
      "overview": "Based on a true story, in which Richmond High School head basketball coach Ken Carter made headlines in 1999 for benching his undefeated team due to poor academic results.",
      "rating": 7.6,
      "release_date": "2005-01-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/y3HOTTyM5nLsdUzXFtFCohG28qj.jpg"
    },
    {
      "title": "The Blind Side",
      "overview": "The story of Michael Oher, a homeless and traumatized boy who became an All American football player and first round NFL draft pick with the help of a caring woman and her family.",
      "rating": 7.67,
      "release_date": "2009-11-20",
      "poster_url": "https://image.tmdb.org/t/p/w500/bMgq7VBriuBFknXEe9E9pVBYGZq.jpg"
    },
    {
      "title": "Mulan",
      "overview": "To save her father from certain death in the army, a young woman secretly enlists in his place and becomes one of China's greatest heroines in the process.",
      "rating": 7.906,
      "release_date": "1998-06-18",
      "poster_url": "https://image.tmdb.org/t/p/w500/5TYgKxYhnhRNNwqnRAKHkgfqi2G.jpg"
    },
    {
      "title": "Erin Brockovich",
      "overview": "A twice-divorced mother of three who sees an injustice, takes on the bad guy and wins -- with a little help from her push-up bra. Erin goes to work for an attorney and comes across medical records describing illnesses clustered in one nearby town. She starts investigating and soon exposes a monumental cover-up.",
      "rating": 7.439,
      "release_date": "2000-03-17",
      "poster_url": "https://image.tmdb.org/t/p/w500/jEMvWBWVjndZT0vJnLrRWi9ajea.jpg"
    },
    {
      "title": "The Founder",
      "overview": "The true story of how Ray Kroc, a salesman from Illinois, met Mac and Dick McDonald, who were running a burger operation in 1950s Southern California. Kroc was impressed by the brothers’ speedy system of making the food and saw franchise potential. He maneuvered himself into a position to be able to pull the company from the brothers and create a billion-dollar empire.",
      "rating": 7.131,
      "release_date": "2016-11-24",
      "poster_url": "https://image.tmdb.org/t/p/w500/8gLIksu5ggdfBL1UbeTeonHquxl.jpg"
    },
    {
      "title": "The Great Debaters",
      "overview": "The true story of a brilliant but politically radical debate team coach who uses the power of words to transform a group of underdog African-American college students into a historical powerhouse that took on the Harvard elite.",
      "rating": 7.251,
      "release_date": "2007-12-25",
      "poster_url": "https://image.tmdb.org/t/p/w500/nuF3DDlZzNb2qq0tEsYU0zpXf8K.jpg"
    },
    {
      "title": "Invictus",
      "overview": "Newly elected President Nelson Mandela knows his nation remains racially and economically divided in the wake of apartheid. Believing he can bring his people together through the universal language of sport, Mandela rallies South Africa's rugby union team as they make their historic run to the 1995 Rugby World Cup Championship match.",
      "rating": 7.181,
      "release_date": "2009-12-11",
      "poster_url": "https://image.tmdb.org/t/p/w500/runuhBAAX7PmdjGhqRKCyl4bh7z.jpg"
    },
    {
      "title": "Bend It Like Beckham",
      "overview": "Jess Bhamra, the daughter of a strict Indian couple in London, is not permitted to play organized soccer, even though she is 18. When Jess is playing for fun one day, her impressive skills are seen by Jules Paxton, who then convinces Jess to play for her semi-pro team. Jess uses elaborate excuses to hide her matches from her family while also dealing with her romantic feelings for her coach, Joe.",
      "rating": 6.312,
      "release_date": "2002-04-11",
      "poster_url": "https://image.tmdb.org/t/p/w500/2dzSBmFWWqt8NbnubJKIWU21Y86.jpg"
    },
    {
      "title": "The Walk",
      "overview": "Pilgrimage or purgatory? Every Wednesday Amar endures a 24-mile round trip on foot to the JobCentre and back to sign on.",
      "rating": 5,
      "release_date": "2023-10-04",
      "poster_url": "https://image.tmdb.org/t/p/w500/2VGYWOjgNs6Vk8Dd8mnhijrPZyV.jpg"
    },
    {
      "title": "127 Hours",
      "overview": "The true story of mountain climber Aron Ralston's remarkable adventure to save himself after a fallen boulder crashes on his arm and traps him in an isolated canyon in Utah.",
      "rating": 7.081,
      "release_date": "2010-11-12",
      "poster_url": "https://image.tmdb.org/t/p/w500/h0RMdn0rfl9l5hWXz3tUh6QVkhi.jpg"
    },
    {
      "title": "Soul Surfer",
      "overview": "The true story of teen surfer Bethany Hamilton, who lost her arm in a shark attack and courageously overcame all odds to become a champion again, through her sheer determination and unwavering faith.",
      "rating": 7.014,
      "release_date": "2011-04-08",
      "poster_url": "https://image.tmdb.org/t/p/w500/cvgRxrEupUFeJ0xzUExJo4dMXbL.jpg"
    },
    {
      "title": "Whiplash",
      "overview": "Under the direction of a ruthless instructor, a talented young drummer begins to pursue perfection at any cost, even his humanity.",
      "rating": 8.376,
      "release_date": "2014-10-10",
      "poster_url": "https://image.tmdb.org/t/p/w500/7fn624j5lj3xTme2SgiLCeuedmO.jpg"
    },
    {
      "title": "Julie & Julia",
      "overview": "Julia Child and Julie Powell – both of whom wrote memoirs – find their lives intertwined. Though separated by time and space, both women are at loose ends... until they discover that with the right combination of passion, fearlessness and butter, anything is possible.",
      "rating": 6.705,
      "release_date": "2009-08-06",
      "poster_url": "https://image.tmdb.org/t/p/w500/r1bFBBj3VMek0oEtgm9N51OqVjF.jpg"
    },
    {
      "title": "The Imitation Game",
      "overview": "Based on the real life story of legendary cryptanalyst Alan Turing, the film portrays the nail-biting race against time by Turing and his brilliant team of code-breakers at Britain's top-secret Government Code and Cypher School at Bletchley Park, during the darkest days of World War II.",
      "rating": 7.994,
      "release_date": "2014-11-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/zSqJ1qFq8NXFfi7JeIYMlzyR0dx.jpg"
    },
    {
      "title": "The Greatest Showman",
      "overview": "The story of American showman P.T. Barnum, founder of the circus that became the famous traveling Ringling Bros. and Barnum & Bailey Circus.",
      "rating": 7.877,
      "release_date": "2017-12-20",
      "poster_url": "https://image.tmdb.org/t/p/w500/b9CeobiihCx1uG1tpw8hXmpi7nm.jpg"
    },
    {
      "title": "Joy",
      "overview": "",
      "rating": 0,
      "release_date": "2023-09-16",
      "poster_url": "https://image.tmdb.org/t/p/w500null"
    },
    {
      "title": "The Fighter",
      "overview": "Boxer \"Irish\" Micky Ward's unlikely road to the world light welterweight title. His Rocky-like rise was shepherded by half-brother Dicky, a boxer-turned-trainer who rebounded in life after nearly being KO'd by drugs and crime.",
      "rating": 7.383,
      "release_date": "2010-12-10",
      "poster_url": "https://image.tmdb.org/t/p/w500/xfsFerGhO1h6rLk8vwLgMyQ8WVJ.jpg"
    },
    {
      "title": "Miracle",
      "overview": "When college coach Herb Brooks is hired to helm the 1980 U.S. men's Olympic hockey team, he brings a unique and brash style to the ice. After assembling a team of hot-headed college all-stars, who are humiliated in an early match, Brooks unites his squad against a common foe: the heavily-favored Soviet team.",
      "rating": 7.087,
      "release_date": "2004-02-06",
      "poster_url": "https://image.tmdb.org/t/p/w500/mxtej2th8t8x0ufVBTyhsO6Htxj.jpg"
    }
  ],
  "Horror": [
    {
      "title": "The Conjuring",
      "overview": "Paranormal investigators Ed and Lorraine Warren work to help a family terrorized by a dark presence in their farmhouse. Forced to confront a powerful entity, the Warrens find themselves caught in the most terrifying case of their lives.",
      "rating": 7.541,
      "release_date": "2013-07-18",
      "poster_url": "https://image.tmdb.org/t/p/w500/wVYREutTvI2tmxr6ujrHT704wGF.jpg"
    },
    {
      "title": "Get Out",
      "overview": "Chris and his girlfriend Rose go upstate to visit her parents for the weekend. At first, Chris reads the family's overly accommodating behavior as nervous attempts to deal with their daughter's interracial relationship, but as the weekend progresses, a series of increasingly disturbing discoveries lead him to a truth that he never could have imagined.",
      "rating": 7.619,
      "release_date": "2017-02-24",
      "poster_url": "https://image.tmdb.org/t/p/w500/mE24wUCfjK8AoBBjaMjho7Rczr7.jpg"
    },
    {
      "title": "The Shining",
      "overview": "Jack Torrance accepts a caretaker job at the Overlook Hotel, where he, along with his wife Wendy and their son Danny, must live isolated from the rest of the world for the winter. But they aren't prepared for the madness that lurks within.",
      "rating": 8.212,
      "release_date": "1980-05-23",
      "poster_url": "https://image.tmdb.org/t/p/w500/xazWoLealQwEgqZ89MLZklLZD3k.jpg"
    },
    {
      "title": "Hereditary",
      "overview": "Following the death of the Leigh family matriarch, Annie and her children uncover disturbing secrets about their heritage. Their daily lives are not only impacted, but they also become entangled in a chilling fate from which they cannot escape, driving them to the brink of madness.",
      "rating": 7.291,
      "release_date": "2018-06-07",
      "poster_url": "https://image.tmdb.org/t/p/w500/4GFPuL14eXi66V96xBWY73Y9PfR.jpg"
    },
    {
      "title": "A Nightmare on Elm Street",
      "overview": "Teenagers in a small town are dropping like flies, apparently in the grip of mass hysteria causing their suicides. A cop's daughter, Nancy Thompson, traces the cause to child molester Fred Krueger, who was burned alive by angry parents many years before. Krueger has now come back in the dreams of his killers' children, claiming their lives as his revenge. Nancy and her boyfriend, Glen, must devise a plan to lure the monster out of the realm of nightmares and into the real world...",
      "rating": 7.3,
      "release_date": "1984-11-09",
      "poster_url": "https://image.tmdb.org/t/p/w500/wGTpGGRMZmyFCcrY2YoxVTIBlli.jpg"
    },
    {
      "title": "The Exorcist",
      "overview": "When a charming 12-year-old girl takes on the characteristics and voices of others, doctors say there is nothing they can do. As people begin to die, the girl's mother realizes her daughter has been possessed by the Devil. Her daughter's only possible hope lies with two priests and the ancient rite of demonic exorcism.",
      "rating": 7.732,
      "release_date": "1973-12-26",
      "poster_url": "https://image.tmdb.org/t/p/w500/5x0CeVHJI8tcDx8tUUwYHQSNILq.jpg"
    },
    {
      "title": "Marlon 2017",
      "overview": "",
      "rating": 0,
      "release_date": "2017-02-13",
      "poster_url": "https://image.tmdb.org/t/p/w500/obgf4HSkIkYZnrjLCKiWTeDwj8p.jpg"
    },
    {
      "title": "The Ring",
      "overview": "Both Jack Sander and Bob Corby are boxers in love with Mabel. Jack and Mabel wed, but their marriage is flat. The young wife looks to Bob for comfort.",
      "rating": 5.9,
      "release_date": "1927-09-28",
      "poster_url": "https://image.tmdb.org/t/p/w500/VeNRpyspVlJzkrNAyszdGtmy9e.jpg"
    },
    {
      "title": "Paranormal Activity: Tokyo Night",
      "overview": "Koichi takes care of his sister, who has recently returned from a trip abroad in the United States as she is not well. While caring for her, he records evidence of ghosts in their home.",
      "rating": 6,
      "release_date": "2010-11-20",
      "poster_url": "https://image.tmdb.org/t/p/w500/mh7j7XlYWo82UnQGhsxcuyolzp.jpg"
    },
    {
      "title": "Halloween",
      "overview": "Fifteen years after murdering his sister on Halloween Night 1963, Michael Myers escapes from a mental hospital and returns to the small town of Haddonfield, Illinois to kill again.",
      "rating": 7.562,
      "release_date": "1978-10-24",
      "poster_url": "https://image.tmdb.org/t/p/w500/wijlZ3HaYMvlDTPqJoTCWKFkCPU.jpg"
    },
    {
      "title": "The Babadook",
      "overview": "A single mother, plagued by the violent death of her husband, battles with her son's fear of a monster lurking in the house, but soon discovers a sinister presence all around her.",
      "rating": 6.517,
      "release_date": "2014-05-22",
      "poster_url": "https://image.tmdb.org/t/p/w500/qt3fqapeo94TfvMyld8P7gkpXLz.jpg"
    },
    {
      "title": "Psycho",
      "overview": "A young female embezzler arrives at the Bates Motel, which has terrible secrets of its own.",
      "rating": 5.117,
      "release_date": "1998-12-04",
      "poster_url": "https://image.tmdb.org/t/p/w500/tY0OLFUsTXdvNppTpnNc4EVYy2z.jpg"
    },
    {
      "title": "The Texas Chain Saw Massacre",
      "overview": "Five friends head out to rural Texas to visit the grave of a grandfather. On the way they stumble across what appears to be a deserted house, only to discover something sinister within. Something armed with a chainsaw.",
      "rating": 7.3,
      "release_date": "1974-10-11",
      "poster_url": "https://image.tmdb.org/t/p/w500/mpgkRPH1GNkMCgdPk2OMyHzAks7.jpg"
    },
    {
      "title": "It Follows",
      "overview": "When carefree teenager Jay sleeps with her older boyfriend for the first time, she learns that she is the latest recipient of a fatal curse that is passed from victim to victim via sexual intercourse. Death, Jay learns, will creep inexorably toward her as either a friend or a stranger. Jay's friends don't believe her seemingly paranoid ravings, until they too begin to see the phantom assassins and band together to help her defend herself.",
      "rating": 6.583,
      "release_date": "2015-02-04",
      "poster_url": "https://image.tmdb.org/t/p/w500/iwnQ1JH1wdWrGYkgWySptJ5284A.jpg"
    },
    {
      "title": "The Chronicles of Narnia: The Lion, the Witch and the Wardrobe",
      "overview": "Siblings Lucy, Edmund, Susan and Peter step through a magical wardrobe and find the land of Narnia. There, they discover a charming, once peaceful kingdom that has been plunged into eternal winter by the evil White Witch, Jadis. Aided by the wise and magnificent lion, Aslan, the children lead Narnia into a spectacular, climactic battle to be free of the Witch's glacial powers forever.",
      "rating": 7.133,
      "release_date": "2005-12-07",
      "poster_url": "https://image.tmdb.org/t/p/w500/iREd0rNCjYdf5Ar0vfaW32yrkm.jpg"
    },
    {
      "title": "The Others",
      "overview": "Grace is a religious woman who lives in an old house kept dark because her two children, Anne and Nicholas, have a rare sensitivity to light. When the family begins to suspect the house is haunted, Grace fights to protect her children at any cost in the face of strange events and disturbing visions.",
      "rating": 7.6,
      "release_date": "2001-08-02",
      "poster_url": "https://image.tmdb.org/t/p/w500/p8g1vlTvpM6nr2hMMiZ1fUlKF0D.jpg"
    },
    {
      "title": "The Silence of the Lambs",
      "overview": "Clarice Starling is a top student at the FBI's training academy.  Jack Crawford wants Clarice to interview Dr. Hannibal Lecter, a brilliant psychiatrist who is also a violent psychopath, serving life behind bars for various acts of murder and cannibalism.  Crawford believes that Lecter may have insight into a case and that Starling, as an attractive young woman, may be just the bait to draw him out.",
      "rating": 8.346,
      "release_date": "1991-02-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/uS9m8OBk1A8eM9I042bx8XXpqAq.jpg"
    },
    {
      "title": "Train to Busan",
      "overview": "When a zombie virus pushes Korea into a state of emergency, those trapped on an express train to Busan must fight for their own survival.",
      "rating": 7.751,
      "release_date": "2016-07-20",
      "poster_url": "https://image.tmdb.org/t/p/w500/vNVFt6dtcqnI7hqa6LFBUibuFiw.jpg"
    },
    {
      "title": "The Grudge",
      "overview": "An American nurse living and working in Tokyo is exposed to a mysterious supernatural curse, one that locks a person in a powerful rage before claiming their life and spreading to another victim.",
      "rating": 5.907,
      "release_date": "2004-10-22",
      "poster_url": "https://image.tmdb.org/t/p/w500/5AGB8FVELnhMMw3nO372sw1xp58.jpg"
    },
    {
      "title": "Sinister",
      "overview": "True-crime writer Ellison Oswald is in a slump; he hasn't had a best seller in more than 10 years and is becoming increasingly desperate for a hit. So, when he discovers the existence of a snuff film showing the deaths of a family, he vows to solve the mystery. He moves his own family into the victims' home and gets to work. However, when old film footage and other clues hint at the presence of a supernatural force, Ellison learns that living in the house may be fatal.",
      "rating": 6.865,
      "release_date": "2012-03-29",
      "poster_url": "https://image.tmdb.org/t/p/w500/nzx10sca3arCeYBAomHan4Q6wa1.jpg"
    },
    {
      "title": "Insidious",
      "overview": "A family discovers that dark spirits have invaded their home after their son inexplicably falls into an endless sleep. When they reach out to a professional for help, they learn things are a lot more personal than they thought.",
      "rating": 6.942,
      "release_date": "2011-03-31",
      "poster_url": "https://image.tmdb.org/t/p/w500/1egpmVXuXed58TH2UOnX1nATTrf.jpg"
    },
    {
      "title": "The Cabin in the Woods",
      "overview": "A group of teens journey to a remote cabin in the woods where their fate is unknowingly controlled by technicians as part of a worldwide conspiracy where all horror movie clichés are revealed to be part of an elaborate sacrifice ritual.",
      "rating": 6.631,
      "release_date": "2012-04-12",
      "poster_url": "https://image.tmdb.org/t/p/w500/zZZe5wn0udlhMtdlDjN4NB72R6e.jpg"
    },
    {
      "title": "The Mist",
      "overview": "After a violent storm, a dense cloud of mist envelops a small Maine town, trapping David Drayton and his five-year-old son in a local grocery store with other local residents. They soon discover that the mist conceals deadly horrors that threaten their lives, and worse, their sanity.",
      "rating": 6.935,
      "release_date": "2007-11-21",
      "poster_url": "https://image.tmdb.org/t/p/w500/1CvJ6diBACKPVGOpcWuY4XPQdqX.jpg"
    },
    {
      "title": "The Blair Witch Project",
      "overview": "In October of 1994 three student filmmakers disappeared in the woods near Burkittsville, Maryland, while shooting a documentary. A year later their footage was found.",
      "rating": 6.349,
      "release_date": "1999-07-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/9050VGrYjYrEjpOvDZVAngLbg1f.jpg"
    },
    {
      "title": "Us",
      "overview": "Husband and wife Gabe and Adelaide Wilson take their kids to their beach house expecting to unplug and unwind with friends. But as night descends, their serenity turns to tension and chaos when some shocking visitors arrive uninvited.",
      "rating": 6.959,
      "release_date": "2019-03-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/ux2dU1jQ2ACIMShzB3yP93Udpzc.jpg"
    },
    {
      "title": "Midsommar",
      "overview": "Several friends travel to Sweden to study as anthropologists a summer festival that is held every ninety years in the remote hometown of one of them. What begins as a dream vacation in a place where the sun never sets, gradually turns into a dark nightmare as the mysterious inhabitants invite them to participate in their disturbing festive activities.",
      "rating": 7.151,
      "release_date": "2019-07-03",
      "poster_url": "https://image.tmdb.org/t/p/w500/7LEI8ulZzO5gy9Ww2NVCrKmHeDZ.jpg"
    },
    {
      "title": "Requiem for a Dream",
      "overview": "The drug-induced utopias of four Coney Island residents are shattered when their addictions run deep.",
      "rating": 8.015,
      "release_date": "2000-10-06",
      "poster_url": "https://image.tmdb.org/t/p/w500/nOd6vjEmzCT0k4VYqsA2hwyi87C.jpg"
    },
    {
      "title": "The Evil Dead",
      "overview": "In 1979, a group of college students find a Sumerian Book of the Dead in an old wilderness cabin they've rented for a weekend getaway.",
      "rating": 7.3,
      "release_date": "1981-09-10",
      "poster_url": "https://image.tmdb.org/t/p/w500/uYxQ6xhP3WjqPZtxyAOnZQWnZqn.jpg"
    },
    {
      "title": "The Descent",
      "overview": "After a tragic accident, six friends reunite for a caving expedition. Their adventure soon goes horribly wrong when a collapse traps them deep underground and they find themselves pursued by bloodthirsty creatures. As their friendships deteriorate, they find themselves in a desperate struggle to survive the creatures and each other.",
      "rating": 6.963,
      "release_date": "2005-07-08",
      "poster_url": "https://image.tmdb.org/t/p/w500/mxFPI4KYBk5ri9cPteIS8jiDFgj.jpg"
    }
  ],
  "Action": [
    {
      "title": "Mad Max: Fury Road",
      "overview": "An apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and most everyone is crazed fighting for the necessities of life. Within this world exist two rebels on the run who just might be able to restore order.",
      "rating": 7.622,
      "release_date": "2015-05-13",
      "poster_url": "https://image.tmdb.org/t/p/w500/hA2ple9q4qnwxp3hKVNhroipsir.jpg"
    },
    {
      "title": "The Dark Knight",
      "overview": "Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker.",
      "rating": 8.52,
      "release_date": "2008-07-16",
      "poster_url": "https://image.tmdb.org/t/p/w500/qJ2tW6WMUDux911r6m7haRef0WH.jpg"
    },
    {
      "title": "Die Hard",
      "overview": "NYPD cop John McClane's plan to reconcile with his estranged wife is thrown for a serious loop when, minutes after he arrives at her offices Christmas Party, the entire building is overtaken by a group of terrorists. With little help from the LAPD, wisecracking McClane sets out to single-handedly rescue the hostages and bring the bad guys down.",
      "rating": 7.798,
      "release_date": "1988-07-15",
      "poster_url": "https://image.tmdb.org/t/p/w500/aJCpHDC6RoGz7d1Fzayl019xnxX.jpg"
    },
    {
      "title": "John Wick",
      "overview": "Ex-hitman John Wick comes out of retirement to track down the gangsters that took everything from him.",
      "rating": 7.445,
      "release_date": "2014-10-22",
      "poster_url": "https://image.tmdb.org/t/p/w500/fZPSd91yGE9fCcCe6OoQr6E3Bev.jpg"
    },
    {
      "title": "Gladiator",
      "overview": "Tommy Riley has moved with his dad to Chicago from a 'nice place'. He keeps to himself, goes to school. However, after a street fight he is noticed and quickly falls into the world of illegal underground boxing - where punches can kill.",
      "rating": 7.6,
      "release_date": "1992-03-06",
      "poster_url": "https://image.tmdb.org/t/p/w500/w0YjBWVfu689txEXZG3xa4Aev3i.jpg"
    },
    {
      "title": "The Matrix",
      "overview": "Set in the 22nd century, The Matrix tells the story of a computer hacker who joins a group of underground insurgents fighting the vast and powerful computers who now rule the earth.",
      "rating": 8.225,
      "release_date": "1999-03-31",
      "poster_url": "https://image.tmdb.org/t/p/w500/dXNAPwY7VrqMAo51EKhhCJfaGb5.jpg"
    },
    {
      "title": "Terminator 2: Judgment Day",
      "overview": "Set ten years after the events of the original, James Cameron’s classic sci-fi action flick tells the story of a second attempt to get rid of rebellion leader John Connor, this time targeting the boy himself. However, the rebellion has sent a reprogrammed terminator to protect Connor.",
      "rating": 8.125,
      "release_date": "1991-07-03",
      "poster_url": "https://image.tmdb.org/t/p/w500/5M0j0B18abtBI5gi2RhfjjurTqb.jpg"
    },
    {
      "title": "The Avengers",
      "overview": "When an unexpected enemy emerges and threatens global safety and security, Nick Fury, director of the international peacekeeping agency known as S.H.I.E.L.D., finds himself in need of a team to pull the world back from the brink of disaster. Spanning the globe, a daring recruitment effort begins!",
      "rating": 7.746,
      "release_date": "2012-04-25",
      "poster_url": "https://image.tmdb.org/t/p/w500/RYMX2wcKCBAr24UyPD7xwmjaTn.jpg"
    },
    {
      "title": "The Bourne Identity",
      "overview": "Wounded to the brink of death and suffering from amnesia, Jason Bourne is rescued at sea by a fisherman. With nothing to go on but a Swiss bank account number, he starts to reconstruct his life, but finds that many people he encounters want him dead. However, Bourne realizes that he has the combat and mental skills of a world-class spy—but who does he work for?",
      "rating": 7.468,
      "release_date": "2002-06-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/aP8swke3gmowbkfZ6lmNidu0y9p.jpg"
    },
    {
      "title": "Mission: Impossible - Fallout",
      "overview": "When an IMF mission ends badly, the world is faced with dire consequences. As Ethan Hunt takes it upon himself to fulfill his original briefing, the CIA begin to question his loyalty and his motives. The IMF team find themselves in a race against time, hunted by assassins while trying to prevent a global catastrophe.",
      "rating": 7.431,
      "release_date": "2018-07-13",
      "poster_url": "https://image.tmdb.org/t/p/w500/AkJQpZp9WoNdj7pLYSj1L0RcMMN.jpg"
    },
    {
      "title": "Furious 7",
      "overview": "Deckard Shaw seeks revenge against Dominic Toretto and his family for his comatose brother.",
      "rating": 7.225,
      "release_date": "2015-04-01",
      "poster_url": "https://image.tmdb.org/t/p/w500/wurKlC3VKUgcfsn0K51MJYEleS2.jpg"
    },
    {
      "title": "The Dark Knight Rises",
      "overview": "Following the death of District Attorney Harvey Dent, Batman assumes responsibility for Dent's crimes to protect the late attorney's reputation and is subsequently hunted by the Gotham City Police Department. Eight years later, Batman encounters the mysterious Selina Kyle and the villainous Bane, a new terrorist leader who overwhelms Gotham's finest. The Dark Knight resurfaces to protect a city that has branded him an enemy.",
      "rating": 7.785,
      "release_date": "2012-07-17",
      "poster_url": "https://image.tmdb.org/t/p/w500/hr0L2aueqlP2BYUblTTjmtn0hw4.jpg"
    },
    {
      "title": "The Raid",
      "overview": "Deep in the heart of Jakarta's slums lies an impenetrable safe house for the world's most dangerous killers and gangsters. Until now, the run-down apartment block has been considered untouchable to even the bravest of police. Cloaked under the cover of pre-dawn darkness and silence, an elite swat team is tasked with raiding the safe house in order to take down the notorious drug lord that runs it.  But when a chance encounter with a spotter blows their cover and news of their assault reaches the drug lord, the building's lights are cut and all the exits blocked. Stranded on the sixth floor with no way out, the unit must fight their way through the city's worst to survive their mission. Starring Indonesian martial arts sensation Iko Uwais.",
      "rating": 7.402,
      "release_date": "2012-03-22",
      "poster_url": "https://image.tmdb.org/t/p/w500/Abnm1Ws3JH0ReCfEhLMPwPcMcGO.jpg"
    },
    {
      "title": "Kingsman: The Secret Service",
      "overview": "The story of a super-secret spy organization that recruits an unrefined but promising street kid into the agency's ultra-competitive training program just as a global threat emerges from a twisted tech genius.",
      "rating": 7.627,
      "release_date": "2015-01-24",
      "poster_url": "https://image.tmdb.org/t/p/w500/r6q9wZK5a2K51KFj4LWVID6Ja1r.jpg"
    },
    {
      "title": "The Incredibles",
      "overview": "Bob Parr has given up his superhero days to log in time as an insurance adjuster and raise his three children with his formerly heroic wife in suburbia. But when he receives a mysterious assignment, it's time to get back into costume.",
      "rating": 7.711,
      "release_date": "2004-10-27",
      "poster_url": "https://image.tmdb.org/t/p/w500/2LqaLgk4Z226KkgPJuiOQ58wvrm.jpg"
    },
    {
      "title": "Spider-Man: Into the Spider-Verse",
      "overview": "Struggling to find his place in the world while juggling school and family, Brooklyn teenager Miles Morales is unexpectedly bitten by a radioactive spider and develops unfathomable powers just like the one and only Spider-Man. While wrestling with the implications of his new abilities, Miles discovers a super collider created by the madman Wilson \"Kingpin\" Fisk, causing others from across the Spider-Verse to be inadvertently transported to his dimension.",
      "rating": 8.397,
      "release_date": "2018-12-06",
      "poster_url": "https://image.tmdb.org/t/p/w500/iiZZdoQBEYBv6id8su7ImL0oCbD.jpg"
    },
    {
      "title": "Casino Royale",
      "overview": "Le Chiffre, a banker to the world's terrorists, is scheduled to participate in a high-stakes poker game in Montenegro, where he intends to use his winnings to establish his financial grip on the terrorist market. M sends Bond—on his maiden mission as a 00 Agent—to attend this game and prevent Le Chiffre from winning. With the help of Vesper Lynd and Felix Leiter, Bond enters the most important poker game in his already dangerous career.",
      "rating": 7.558,
      "release_date": "2006-11-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/lMrxYKKhd4lqRzwUHAy5gcx9PSO.jpg"
    },
    {
      "title": "Iron Man",
      "overview": "After being held captive in an Afghan cave, billionaire engineer Tony Stark creates a unique weaponized suit of armor to fight evil.",
      "rating": 7.651,
      "release_date": "2008-04-30",
      "poster_url": "https://image.tmdb.org/t/p/w500/78lPtwv72eTNqFW9COBYI0dWDJa.jpg"
    },
    {
      "title": "300",
      "overview": "Based on Frank Miller's graphic novel, \"300\" is very loosely based the 480 B.C. Battle of Thermopylae, where the King of Sparta led his army against the advancing Persians; the battle is said to have inspired all of Greece to band together against the Persians, and helped usher in the world's first democracy.",
      "rating": 7.187,
      "release_date": "2007-03-07",
      "poster_url": "https://image.tmdb.org/t/p/w500/h7Lcio0c9ohxPhSZg42eTlKIVVY.jpg"
    },
    {
      "title": "Skyfall",
      "overview": "When Bond's latest assignment goes gravely wrong, agents around the world are exposed and MI6 headquarters is attacked. While M faces challenges to her authority and position from Gareth Mallory, the new Chairman of the Intelligence and Security Committee, it's up to Bond, aided only by field agent Eve, to locate the mastermind behind the attack.",
      "rating": 7.249,
      "release_date": "2012-10-24",
      "poster_url": "https://image.tmdb.org/t/p/w500/d0IVecFQvsGdSbnMAHqiYsNYaJT.jpg"
    },
    {
      "title": "Deadpool",
      "overview": "The origin story of former Special Forces operative turned mercenary Wade Wilson, who, after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with his new abilities and a dark, twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life.",
      "rating": 7.6,
      "release_date": "2016-02-09",
      "poster_url": "https://image.tmdb.org/t/p/w500/3E53WEZJqP6aM84D8CckXx4pIHw.jpg"
    },
    {
      "title": "Thor: Ragnarok",
      "overview": "Thor is imprisoned on the other side of the universe and finds himself in a race against time to get back to Asgard to stop Ragnarok, the destruction of his home-world and the end of Asgardian civilization, at the hands of a powerful new threat, the ruthless Hela.",
      "rating": 7.584,
      "release_date": "2017-10-02",
      "poster_url": "https://image.tmdb.org/t/p/w500/rzRwTcFvttcN1ZpX2xv4j3tSdJu.jpg"
    },
    {
      "title": "The Magnificent Seven",
      "overview": "Looking to mine for gold, greedy industrialist Bartholomew Bogue seizes control of the Old West town of Rose Creek. With their lives in jeopardy, Emma Cullen and other desperate residents turn to bounty hunter Sam Chisolm for help. Chisolm recruits an eclectic group of gunslingers to take on Bogue and his ruthless henchmen. With a deadly showdown on the horizon, the seven mercenaries soon find themselves fighting for more than just money once the bullets start to fly.",
      "rating": 6.5,
      "release_date": "2016-09-14",
      "poster_url": "https://image.tmdb.org/t/p/w500/ezcS78TIjgr85pVdaPDd2rSPVNs.jpg"
    },
    {
      "title": "Edge of Tomorrow",
      "overview": "Major Bill Cage is an officer who has never seen a day of combat when he is unceremoniously demoted and dropped into combat. Cage is killed within minutes, managing to take an alpha alien down with him. He awakens back at the beginning of the same day and is forced to fight and die again... and again - as physical contact with the alien has thrown him into a time loop.",
      "rating": 7.63,
      "release_date": "2014-05-27",
      "poster_url": "https://image.tmdb.org/t/p/w500/uUHvlkLavotfGsNtosDy8ShsIYF.jpg"
    },
    {
      "title": "Pacific Rim",
      "overview": "Using massive piloted robots to combat the alien threat, earth's survivors take the fight to the invading alien force lurking in the depths of the Pacific Ocean. Nearly defenseless in the face of the relentless enemy, the forces of mankind have no choice but to turn to two unlikely heroes who now stand as earth's final hope against the mounting apocalypse.",
      "rating": 6.909,
      "release_date": "2013-07-11",
      "poster_url": "https://image.tmdb.org/t/p/w500/mmznhaQDwlHWpUwKuNxtQiubbmM.jpg"
    },
    {
      "title": "Batman Begins",
      "overview": "Driven by tragedy, billionaire Bruce Wayne dedicates his life to uncovering and defeating the corruption that plagues his home, Gotham City.  Unable to work within the system, he instead creates a new identity, a symbol of fear for the criminal underworld - The Batman.",
      "rating": 7.713,
      "release_date": "2005-06-10",
      "poster_url": "https://image.tmdb.org/t/p/w500/4MpN4kIEqUjW8OPtOQJXlTdHiJV.jpg"
    },
    {
      "title": "Guardians of the Galaxy",
      "overview": "Light years from Earth, 26 years after being abducted, Peter Quill finds himself the prime target of a manhunt after discovering an orb wanted by Ronan the Accuser.",
      "rating": 7.904,
      "release_date": "2014-07-30",
      "poster_url": "https://image.tmdb.org/t/p/w500/jPrJPZKJVhvyJ4DmUTrDgmFN0yG.jpg"
    },
    {
      "title": "The Equalizer",
      "overview": "McCall believes he has put his mysterious past behind him and dedicated himself to beginning a new, quiet life. But when he meets Teri, a young girl under the control of ultra-violent Russian gangsters, he can’t stand idly by – he has to help her. Armed with hidden skills that allow him to serve vengeance against anyone who would brutalize the helpless, McCall comes out of his self-imposed retirement and finds his desire for justice reawakened. If someone has a problem, if the odds are stacked against them, if they have nowhere else to turn, McCall will help. He is The Equalizer.",
      "rating": 7.28,
      "release_date": "2014-09-24",
      "poster_url": "https://image.tmdb.org/t/p/w500/9u4yW7yPA0BQ2pv9XwiNzItwvp8.jpg"
    },
    {
      "title": "The Hunger Games",
      "overview": "Every year in the ruins of what was once North America, the nation of Panem forces each of its twelve districts to send a teenage boy and girl to compete in the Hunger Games.  Part twisted entertainment, part government intimidation tactic, the Hunger Games are a nationally televised event in which “Tributes” must fight with one another until one survivor remains.  Pitted against highly-trained Tributes who have prepared for these Games their entire lives, Katniss is forced to rely upon her sharp instincts as well as the mentorship of drunken former victor Haymitch Abernathy.  If she’s ever to return home to District 12, Katniss must make impossible choices in the arena that weigh survival against humanity and life against love. The world will be watching.",
      "rating": 7.215,
      "release_date": "2012-03-12",
      "poster_url": "https://image.tmdb.org/t/p/w500/yXCbOiVDCxO71zI7cuwBRXdftq8.jpg"
    }
  ]
}